HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
/*************  Bit definition for FLASH_EXT_FLASH_KEY1 register  *************/
#define FLASH_EXT_FLASH_KEY1_EXT_FLASH_KEY1_Pos   (16U)                                       /*!< 0x00FF0000 */
#define FLASH_EXT_FLASH_KEY1_EXT_FLASH_KEY1_Msk   (0xFFU << FLASH_EXT_FLASH_KEY1_EXT_FLASH_KEY1_Pos)
#define FLASH_EXT_FLASH_KEY1_EXT_FLASH_KEY1       FLASH_EXT_FLASH_KEY1_EXT_FLASH_KEY1_Msk     /*!< External memory ciphertext encryption key byte 1 */
#define FLASH_EXT_FLASH_KEY1_nEXT_FLASH_KEY1_Pos  (24U)                                       /*!< 0xFF000000 */
#define FLASH_EXT_FLASH_KEY1_nEXT_FLASH_KEY1_Msk  (0xFFU << FLASH_EXT_FLASH_KEY1_nEXT_FLASH_KEY1_Pos)
#define FLASH_EXT_FLASH_KEY1_nEXT_FLASH_KEY1      FLASH_EXT_FLASH_KEY1_nEXT_FLASH_KEY1_Msk    /*!< Inverse code of external memory ciphertext encryption key byte 1 */

/*************  Bit definition for FLASH_EXT_FLASH_KEY2 register  *************/
#define FLASH_EXT_FLASH_KEY2_EXT_FLASH_KEY2_Pos   (0U)                                        /*!< 0x000000FF */
#define FLASH_EXT_FLASH_KEY2_EXT_FLASH_KEY2_Msk   (0xFFU << FLASH_EXT_FLASH_KEY2_EXT_FLASH_KEY2_Pos)
#define FLASH_EXT_FLASH_KEY2_EXT_FLASH_KEY2       FLASH_EXT_FLASH_KEY2_EXT_FLASH_KEY2_Msk     /*!< External memory ciphertext encryption key byte 2 */
#define FLASH_EXT_FLASH_KEY2_nEXT_FLASH_KEY2_Pos  (8U)                                        /*!< 0x0000FF00 */
#define FLASH_EXT_FLASH_KEY2_nEXT_FLASH_KEY2_Msk  (0xFFU << FLASH_EXT_FLASH_KEY2_nEXT_FLASH_KEY2_Pos)
#define FLASH_EXT_FLASH_KEY2_nEXT_FLASH_KEY2      FLASH_EXT_FLASH_KEY2_nEXT_FLASH_KEY2_Msk    /*!< Inverse code of external memory ciphertext encryption key byte 2 */

/*************  Bit definition for FLASH_EXT_FLASH_KEY3 register  *************/
#define FLASH_EXT_FLASH_KEY3_EXT_FLASH_KEY3_Pos   (16U)                                       /*!< 0x00FF0000 */
#define FLASH_EXT_FLASH_KEY3_EXT_FLASH_KEY3_Msk   (0xFFU << FLASH_EXT_FLASH_KEY3_EXT_FLASH_KEY3_Pos)
#define FLASH_EXT_FLASH_KEY3_EXT_FLASH_KEY3       FLASH_EXT_FLASH_KEY3_EXT_FLASH_KEY3_Msk     /*!< External memory ciphertext encryption key byte 3 */
#define FLASH_EXT_FLASH_KEY3_nEXT_FLASH_KEY3_Pos  (24U)                                       /*!< 0xFF000000 */
#define FLASH_EXT_FLASH_KEY3_nEXT_FLASH_KEY3_Msk  (0xFFU << FLASH_EXT_FLASH_KEY3_nEXT_FLASH_KEY3_Pos)
#define FLASH_EXT_FLASH_KEY3_nEXT_FLASH_KEY3      FLASH_EXT_FLASH_KEY3_nEXT_FLASH_KEY3_Msk    /*!< Inverse code of external memory ciphertext encryption key byte 3 */

/*************  Bit definition for FLASH_EXT_FLASH_KEY4 register  *************/
#define FLASH_EXT_FLASH_KEY4_EXT_FLASH_KEY4_Pos   (0U)                                        /*!< 0x000000FF */
#define FLASH_EXT_FLASH_KEY4_EXT_FLASH_KEY4_Msk   (0xFFU << FLASH_EXT_FLASH_KEY4_EXT_FLASH_KEY4_Pos)
#define FLASH_EXT_FLASH_KEY4_EXT_FLASH_KEY4       FLASH_EXT_FLASH_KEY4_EXT_FLASH_KEY4_Msk     /*!< External memory ciphertext encryption key byte 4 */
#define FLASH_EXT_FLASH_KEY4_nEXT_FLASH_KEY4_Pos  (8U)                                        /*!< 0x0000FF00 */
#define FLASH_EXT_FLASH_KEY4_nEXT_FLASH_KEY4_Msk  (0xFFU << FLASH_EXT_FLASH_KEY4_nEXT_FLASH_KEY4_Pos)
#define FLASH_EXT_FLASH_KEY4_nEXT_FLASH_KEY4      FLASH_EXT_FLASH_KEY4_nEXT_FLASH_KEY4_Msk    /*!< Inverse code of external memory ciphertext encryption key byte 4 */

/*************  Bit definition for FLASH_EXT_FLASH_KEY5 register  *************/
#define FLASH_EXT_FLASH_KEY5_EXT_FLASH_KEY5_Pos   (16U)                                       /*!< 0x00FF0000 */
#define FLASH_EXT_FLASH_KEY5_EXT_FLASH_KEY5_Msk   (0xFFU << FLASH_EXT_FLASH_KEY5_EXT_FLASH_KEY5_Pos)
#define FLASH_EXT_FLASH_KEY5_EXT_FLASH_KEY5       FLASH_EXT_FLASH_KEY5_EXT_FLASH_KEY5_Msk     /*!< External memory ciphertext encryption key byte 5 */
#define FLASH_EXT_FLASH_KEY5_nEXT_FLASH_KEY5_Pos  (24U)                                       /*!< 0xFF000000 */
#define FLASH_EXT_FLASH_KEY5_nEXT_FLASH_KEY5_Msk  (0xFFU << FLASH_EXT_FLASH_KEY5_nEXT_FLASH_KEY5_Pos)
#define FLASH_EXT_FLASH_KEY5_nEXT_FLASH_KEY5      FLASH_EXT_FLASH_KEY5_nEXT_FLASH_KEY5_Msk    /*!< Inverse code of external memory ciphertext encryption key byte 5 */

/*************  Bit definition for FLASH_EXT_FLASH_KEY6 register  *************/
#define FLASH_EXT_FLASH_KEY6_EXT_FLASH_KEY6_Pos   (0U)                                        /*!< 0x000000FF */
#define FLASH_EXT_FLASH_KEY6_EXT_FLASH_KEY6_Msk   (0xFFU << FLASH_EXT_FLASH_KEY6_EXT_FLASH_KEY6_Pos)
#define FLASH_EXT_FLASH_KEY6_EXT_FLASH_KEY6       FLASH_EXT_FLASH_KEY6_EXT_FLASH_KEY6_Msk     /*!< External memory ciphertext encryption key byte 6 */
#define FLASH_EXT_FLASH_KEY6_nEXT_FLASH_KEY6_Pos  (8U)                                        /*!< 0x0000FF00 */
#define FLASH_EXT_FLASH_KEY6_nEXT_FLASH_KEY6_Msk  (0xFFU << FLASH_EXT_FLASH_KEY6_nEXT_FLASH_KEY6_Pos)
#define FLASH_EXT_FLASH_KEY6_nEXT_FLASH_KEY6      FLASH_EXT_FLASH_KEY6_nEXT_FLASH_KEY6_Msk    /*!< Inverse code of external memory ciphertext encryption key byte 6 */

/*************  Bit definition for FLASH_EXT_FLASH_KEY7 register  *************/
#define FLASH_EXT_FLASH_KEY7_EXT_FLASH_KEY7_Pos   (16U)                                       /*!< 0x00FF0000 */
#define FLASH_EXT_FLASH_KEY7_EXT_FLASH_KEY7_Msk   (0xFFU << FLASH_EXT_FLASH_KEY7_EXT_FLASH_KEY7_Pos)
#define FLASH_EXT_FLASH_KEY7_EXT_FLASH_KEY7       FLASH_EXT_FLASH_KEY7_EXT_FLASH_KEY7_Msk     /*!< External memory ciphertext encryption key byte 7 */
#define FLASH_EXT_FLASH_KEY7_nEXT_FLASH_KEY7_Pos  (24U)                                       /*!< 0xFF000000 */
#define FLASH_EXT_FLASH_KEY7_nEXT_FLASH_KEY7_Msk  (0xFFU << FLASH_EXT_FLASH_KEY7_nEXT_FLASH_KEY7_Pos)
#define FLASH_EXT_FLASH_KEY7_nEXT_FLASH_KEY7      FLASH_EXT_FLASH_KEY7_nEXT_FLASH_KEY7_Msk    /*!< Inverse code of external memory ciphertext encryption key byte 7 */

/******************************************************************************/
/*                                                                            */
/*                        General-purpose I/Os (GPIO)                         */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for GPIO_CFGLR register  ******************/
#define GPIO_CFGLR_IOMC_Pos                 (0U)
#define GPIO_CFGLR_IOMC_Msk                 (0x33333333U << GPIO_CFGLR_IOMC_Pos)    /*!< 0x33333333 */
#define GPIO_CFGLR_IOMC                     GPIO_CFGLR_IOMC_Msk                     /*!< GPIO x mode configuration */

#define GPIO_CFGLR_IOMC0_Pos                (0U)
#define GPIO_CFGLR_IOMC0_Msk                (0x3U << GPIO_CFGLR_IOMC0_Pos)          /*!< 0x00000003 */
#define GPIO_CFGLR_IOMC0                    GPIO_CFGLR_IOMC0_Msk                    /*!< IOMC0[1:0] bits (GPIO x mode configuration, pin 0) */
#define GPIO_CFGLR_IOMC0_0                  (0x1U << GPIO_CFGLR_IOMC0_Pos)          /*!< 0x00000001 */
#define GPIO_CFGLR_IOMC0_1                  (0x2U << GPIO_CFGLR_IOMC0_Pos)          /*!< 0x00000002 */

#define GPIO_CFGLR_IOMC1_Pos                (4U)
#define GPIO_CFGLR_IOMC1_Msk                (0x3U << GPIO_CFGLR_IOMC1_Pos)          /*!< 0x00000030 */
#define GPIO_CFGLR_IOMC1                    GPIO_CFGLR_IOMC1_Msk                    /*!< IOMC1[1:0] bits (GPIO x mode configuration, pin 1) */
#define GPIO_CFGLR_IOMC1_0                  (0x1U << GPIO_CFGLR_IOMC1_Pos)          /*!< 0x00000010 */
#define GPIO_CFGLR_IOMC1_1                  (0x2U << GPIO_CFGLR_IOMC1_Pos)          /*!< 0x00000020 */

#define GPIO_CFGLR_IOMC2_Pos                (8U)
#define GPIO_CFGLR_IOMC2_Msk                (0x3U << GPIO_CFGLR_IOMC2_Pos)          /*!< 0x00000300 */
#define GPIO_CFGLR_IOMC2                    GPIO_CFGLR_IOMC2_Msk                    /*!< IOMC2[1:0] bits (GPIO x mode configuration, pin 2) */
#define GPIO_CFGLR_IOMC2_0                  (0x1U << GPIO_CFGLR_IOMC2_Pos)          /*!< 0x00000100 */
#define GPIO_CFGLR_IOMC2_1                  (0x2U << GPIO_CFGLR_IOMC2_Pos)          /*!< 0x00000200 */

