HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
#define IOMUX_EXINTC2_EXINT4_GPA            0x00000000U                             /*!< GPIOA pin 4 */
#define IOMUX_EXINTC2_EXINT4_GPB_Pos        (0U)
#define IOMUX_EXINTC2_EXINT4_GPB_Msk        (0x1U << IOMUX_EXINTC2_EXINT4_GPB_Pos)  /*!< 0x00000001 */
#define IOMUX_EXINTC2_EXINT4_GPB            IOMUX_EXINTC2_EXINT4_GPB_Msk            /*!< GPIOB pin 4 */
#define IOMUX_EXINTC2_EXINT4_GPC_Pos        (1U)
#define IOMUX_EXINTC2_EXINT4_GPC_Msk        (0x1U << IOMUX_EXINTC2_EXINT4_GPC_Pos)  /*!< 0x00000002 */
#define IOMUX_EXINTC2_EXINT4_GPC            IOMUX_EXINTC2_EXINT4_GPC_Msk            /*!< GPIOC pin 4 */
#define IOMUX_EXINTC2_EXINT4_GPD_Pos        (0U)
#define IOMUX_EXINTC2_EXINT4_GPD_Msk        (0x3U << IOMUX_EXINTC2_EXINT4_GPD_Pos)  /*!< 0x00000003 */
#define IOMUX_EXINTC2_EXINT4_GPD            IOMUX_EXINTC2_EXINT4_GPD_Msk            /*!< GPIOD pin 4 */
#define IOMUX_EXINTC2_EXINT4_GPE_Pos        (2U)
#define IOMUX_EXINTC2_EXINT4_GPE_Msk        (0x1U << IOMUX_EXINTC2_EXINT4_GPE_Pos)  /*!< 0x00000004 */
#define IOMUX_EXINTC2_EXINT4_GPE            IOMUX_EXINTC2_EXINT4_GPE_Msk            /*!< GPIOE pin 4 */

/* EXINT5 configuration */
#define IOMUX_EXINTC2_EXINT5_Pos            (4U)
#define IOMUX_EXINTC2_EXINT5_Msk            (0xFU << IOMUX_EXINTC2_EXINT5_Pos)      /*!< 0x000000F0 */
#define IOMUX_EXINTC2_EXINT5                IOMUX_EXINTC2_EXINT5_Msk                /*!< EXINT5[3:0] bits (EXINT5 input source configuration) */

#define IOMUX_EXINTC2_EXINT5_GPA            0x00000000U                             /*!< GPIOA pin 5 */
#define IOMUX_EXINTC2_EXINT5_GPB_Pos        (4U)
#define IOMUX_EXINTC2_EXINT5_GPB_Msk        (0x1U << IOMUX_EXINTC2_EXINT5_GPB_Pos)  /*!< 0x00000010 */
#define IOMUX_EXINTC2_EXINT5_GPB            IOMUX_EXINTC2_EXINT5_GPB_Msk            /*!< GPIOB pin 5 */
#define IOMUX_EXINTC2_EXINT5_GPC_Pos        (5U)
#define IOMUX_EXINTC2_EXINT5_GPC_Msk        (0x1U << IOMUX_EXINTC2_EXINT5_GPC_Pos)  /*!< 0x00000020 */
#define IOMUX_EXINTC2_EXINT5_GPC            IOMUX_EXINTC2_EXINT5_GPC_Msk            /*!< GPIOC pin 5 */
#define IOMUX_EXINTC2_EXINT5_GPD_Pos        (4U)
#define IOMUX_EXINTC2_EXINT5_GPD_Msk        (0x3U << IOMUX_EXINTC2_EXINT5_GPD_Pos)  /*!< 0x00000030 */
#define IOMUX_EXINTC2_EXINT5_GPD            IOMUX_EXINTC2_EXINT5_GPD_Msk            /*!< GPIOD pin 5 */
#define IOMUX_EXINTC2_EXINT5_GPE_Pos        (6U)
#define IOMUX_EXINTC2_EXINT5_GPE_Msk        (0x1U << IOMUX_EXINTC2_EXINT5_GPE_Pos)  /*!< 0x00000040 */
#define IOMUX_EXINTC2_EXINT5_GPE            IOMUX_EXINTC2_EXINT5_GPE_Msk            /*!< GPIOE pin 5 */

/*!< EXINT6 configuration */
#define IOMUX_EXINTC2_EXINT6_Pos            (8U)
#define IOMUX_EXINTC2_EXINT6_Msk            (0xFU << IOMUX_EXINTC2_EXINT6_Pos)      /*!< 0x00000F00 */
#define IOMUX_EXINTC2_EXINT6                IOMUX_EXINTC2_EXINT6_Msk                /*!< EXINT6[3:0] bits (EXINT6 input source configuration) */

#define IOMUX_EXINTC2_EXINT6_GPA            0x00000000U                             /*!< GPIOA pin 6 */
#define IOMUX_EXINTC2_EXINT6_GPB_Pos        (8U)
#define IOMUX_EXINTC2_EXINT6_GPB_Msk        (0x1U << IOMUX_EXINTC2_EXINT6_GPB_Pos)  /*!< 0x00000100 */
#define IOMUX_EXINTC2_EXINT6_GPB            IOMUX_EXINTC2_EXINT6_GPB_Msk            /*!< GPIOB pin 6 */
#define IOMUX_EXINTC2_EXINT6_GPC_Pos        (9U)
#define IOMUX_EXINTC2_EXINT6_GPC_Msk        (0x1U << IOMUX_EXINTC2_EXINT6_GPC_Pos)  /*!< 0x00000200 */
#define IOMUX_EXINTC2_EXINT6_GPC            IOMUX_EXINTC2_EXINT6_GPC_Msk            /*!< GPIOC pin 6 */
#define IOMUX_EXINTC2_EXINT6_GPD_Pos        (8U)
#define IOMUX_EXINTC2_EXINT6_GPD_Msk        (0x3U << IOMUX_EXINTC2_EXINT6_GPD_Pos)  /*!< 0x00000300 */
#define IOMUX_EXINTC2_EXINT6_GPD            IOMUX_EXINTC2_EXINT6_GPD_Msk            /*!< GPIOD pin 6 */
#define IOMUX_EXINTC2_EXINT6_GPE_Pos        (10U)
#define IOMUX_EXINTC2_EXINT6_GPE_Msk        (0x1U << IOMUX_EXINTC2_EXINT6_GPE_Pos)  /*!< 0x00000400 */
#define IOMUX_EXINTC2_EXINT6_GPE            IOMUX_EXINTC2_EXINT6_GPE_Msk            /*!< GPIOE pin 6 */

/*!< EXINT7 configuration */
#define IOMUX_EXINTC2_EXINT7_Pos            (12U)
#define IOMUX_EXINTC2_EXINT7_Msk            (0xFU << IOMUX_EXINTC2_EXINT7_Pos)      /*!< 0x0000F000 */
#define IOMUX_EXINTC2_EXINT7                IOMUX_EXINTC2_EXINT7_Msk                /*!< EXINT7[3:0] bits (EXINT7 input source configuration) */

#define IOMUX_EXINTC2_EXINT7_GPA            0x00000000U                             /*!< GPIOA pin 7 */
#define IOMUX_EXINTC2_EXINT7_GPB_Pos        (12U)
#define IOMUX_EXINTC2_EXINT7_GPB_Msk        (0x1U << IOMUX_EXINTC2_EXINT7_GPB_Pos)  /*!< 0x00001000 */
#define IOMUX_EXINTC2_EXINT7_GPB            IOMUX_EXINTC2_EXINT7_GPB_Msk            /*!< GPIOB pin 7 */
#define IOMUX_EXINTC2_EXINT7_GPC_Pos        (13U)
#define IOMUX_EXINTC2_EXINT7_GPC_Msk        (0x1U << IOMUX_EXINTC2_EXINT7_GPC_Pos)  /*!< 0x00002000 */
#define IOMUX_EXINTC2_EXINT7_GPC            IOMUX_EXINTC2_EXINT7_GPC_Msk            /*!< GPIOC pin 7 */
#define IOMUX_EXINTC2_EXINT7_GPD_Pos        (12U)
#define IOMUX_EXINTC2_EXINT7_GPD_Msk        (0x3U << IOMUX_EXINTC2_EXINT7_GPD_Pos)  /*!< 0x00003000 */
#define IOMUX_EXINTC2_EXINT7_GPD            IOMUX_EXINTC2_EXINT7_GPD_Msk            /*!< GPIOD pin 7 */
#define IOMUX_EXINTC2_EXINT7_GPE_Pos        (14U)
#define IOMUX_EXINTC2_EXINT7_GPE_Msk        (0x1U << IOMUX_EXINTC2_EXINT7_GPE_Pos)  /*!< 0x00004000 */
#define IOMUX_EXINTC2_EXINT7_GPE            IOMUX_EXINTC2_EXINT7_GPE_Msk            /*!< GPIOE pin 7 */

/****************  Bit definition for IOMUX_EXINTC3 register  *****************/
/*!< EXINT8 configuration */
#define IOMUX_EXINTC3_EXINT8_Pos            (0U)
#define IOMUX_EXINTC3_EXINT8_Msk            (0xFU << IOMUX_EXINTC3_EXINT8_Pos)      /*!< 0x0000000F */
#define IOMUX_EXINTC3_EXINT8                IOMUX_EXINTC3_EXINT8_Msk                /*!< EXINT8[3:0] bits (EXINT8 input source configuration) */

#define IOMUX_EXINTC3_EXINT8_GPA            0x00000000U                             /*!< GPIOA pin 8 */
#define IOMUX_EXINTC3_EXINT8_GPB_Pos        (0U)
#define IOMUX_EXINTC3_EXINT8_GPB_Msk        (0x1U << IOMUX_EXINTC3_EXINT8_GPB_Pos)  /*!< 0x00000001 */
#define IOMUX_EXINTC3_EXINT8_GPB            IOMUX_EXINTC3_EXINT8_GPB_Msk            /*!< GPIOB pin 8 */
#define IOMUX_EXINTC3_EXINT8_GPC_Pos        (1U)
#define IOMUX_EXINTC3_EXINT8_GPC_Msk        (0x1U << IOMUX_EXINTC3_EXINT8_GPC_Pos)  /*!< 0x00000002 */
#define IOMUX_EXINTC3_EXINT8_GPC            IOMUX_EXINTC3_EXINT8_GPC_Msk            /*!< GPIOC pin 8 */
#define IOMUX_EXINTC3_EXINT8_GPD_Pos        (0U)
#define IOMUX_EXINTC3_EXINT8_GPD_Msk        (0x3U << IOMUX_EXINTC3_EXINT8_GPD_Pos)  /*!< 0x00000003 */
#define IOMUX_EXINTC3_EXINT8_GPD            IOMUX_EXINTC3_EXINT8_GPD_Msk            /*!< GPIOD pin 8 */
#define IOMUX_EXINTC3_EXINT8_GPE_Pos        (2U)
#define IOMUX_EXINTC3_EXINT8_GPE_Msk        (0x1U << IOMUX_EXINTC3_EXINT8_GPE_Pos)  /*!< 0x00000004 */
#define IOMUX_EXINTC3_EXINT8_GPE            IOMUX_EXINTC3_EXINT8_GPE_Msk            /*!< GPIOE pin 8 */

/*!< EXINT9 configuration */
#define IOMUX_EXINTC3_EXINT9_Pos            (4U)
#define IOMUX_EXINTC3_EXINT9_Msk            (0xFU << IOMUX_EXINTC3_EXINT9_Pos)      /*!< 0x000000F0 */
#define IOMUX_EXINTC3_EXINT9                IOMUX_EXINTC3_EXINT9_Msk                /*!< EXINT9[3:0] bits (EXINT9 input source configuration) */

