HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
#define IOMUX_EXINTC3_EXINT9_GPA            0x00000000U                             /*!< GPIOA pin 9 */
#define IOMUX_EXINTC3_EXINT9_GPB_Pos        (4U)
#define IOMUX_EXINTC3_EXINT9_GPB_Msk        (0x1U << IOMUX_EXINTC3_EXINT9_GPB_Pos)  /*!< 0x00000010 */
#define IOMUX_EXINTC3_EXINT9_GPB            IOMUX_EXINTC3_EXINT9_GPB_Msk            /*!< GPIOB pin 9 */
#define IOMUX_EXINTC3_EXINT9_GPC_Pos        (5U)
#define IOMUX_EXINTC3_EXINT9_GPC_Msk        (0x1U << IOMUX_EXINTC3_EXINT9_GPC_Pos)  /*!< 0x00000020 */
#define IOMUX_EXINTC3_EXINT9_GPC            IOMUX_EXINTC3_EXINT9_GPC_Msk            /*!< GPIOC pin 9 */
#define IOMUX_EXINTC3_EXINT9_GPD_Pos        (4U)
#define IOMUX_EXINTC3_EXINT9_GPD_Msk        (0x3U << IOMUX_EXINTC3_EXINT9_GPD_Pos)  /*!< 0x00000030 */
#define IOMUX_EXINTC3_EXINT9_GPD            IOMUX_EXINTC3_EXINT9_GPD_Msk            /*!< GPIOD pin 9 */
#define IOMUX_EXINTC3_EXINT9_GPE_Pos        (6U)
#define IOMUX_EXINTC3_EXINT9_GPE_Msk        (0x1U << IOMUX_EXINTC3_EXINT9_GPE_Pos)  /*!< 0x00000040 */
#define IOMUX_EXINTC3_EXINT9_GPE            IOMUX_EXINTC3_EXINT9_GPE_Msk            /*!< GPIOE pin 9 */

/*!< EXINT10 configuration */
#define IOMUX_EXINTC3_EXINT10_Pos           (8U)
#define IOMUX_EXINTC3_EXINT10_Msk           (0xFU << IOMUX_EXINTC3_EXINT10_Pos)     /*!< 0x00000F00 */
#define IOMUX_EXINTC3_EXINT10               IOMUX_EXINTC3_EXINT10_Msk               /*!< EXINT10[3:0] bits (EXINT10 input source configuration) */

#define IOMUX_EXINTC3_EXINT10_GPA           0x00000000U                             /*!< GPIOA pin 10 */
#define IOMUX_EXINTC3_EXINT10_GPB_Pos       (8U)
#define IOMUX_EXINTC3_EXINT10_GPB_Msk       (0x1U << IOMUX_EXINTC3_EXINT10_GPB_Pos) /*!< 0x00000100 */
#define IOMUX_EXINTC3_EXINT10_GPB           IOMUX_EXINTC3_EXINT10_GPB_Msk           /*!< GPIOB pin 10 */
#define IOMUX_EXINTC3_EXINT10_GPC_Pos       (9U)
#define IOMUX_EXINTC3_EXINT10_GPC_Msk       (0x1U << IOMUX_EXINTC3_EXINT10_GPC_Pos) /*!< 0x00000200 */
#define IOMUX_EXINTC3_EXINT10_GPC           IOMUX_EXINTC3_EXINT10_GPC_Msk           /*!< GPIOC pin 10 */
#define IOMUX_EXINTC3_EXINT10_GPD_Pos       (8U)
#define IOMUX_EXINTC3_EXINT10_GPD_Msk       (0x3U << IOMUX_EXINTC3_EXINT10_GPD_Pos) /*!< 0x00000300 */
#define IOMUX_EXINTC3_EXINT10_GPD           IOMUX_EXINTC3_EXINT10_GPD_Msk           /*!< GPIOD pin 10 */
#define IOMUX_EXINTC3_EXINT10_GPE_Pos       (10U)
#define IOMUX_EXINTC3_EXINT10_GPE_Msk       (0x1U << IOMUX_EXINTC3_EXINT10_GPE_Pos) /*!< 0x00000400 */
#define IOMUX_EXINTC3_EXINT10_GPE           IOMUX_EXINTC3_EXINT10_GPE_Msk           /*!< GPIOE pin 10 */

/*!< EXINT11 configuration */
#define IOMUX_EXINTC3_EXINT11_Pos           (12U)
#define IOMUX_EXINTC3_EXINT11_Msk           (0xFU << IOMUX_EXINTC3_EXINT11_Pos)     /*!< 0x0000F000 */
#define IOMUX_EXINTC3_EXINT11               IOMUX_EXINTC3_EXINT11_Msk               /*!< EXINT11[3:0] bits (EXINT11 input source configuration) */

#define IOMUX_EXINTC3_EXINT11_GPA           0x00000000U                             /*!< GPIOA pin 11 */
#define IOMUX_EXINTC3_EXINT11_GPB_Pos       (12U)
#define IOMUX_EXINTC3_EXINT11_GPB_Msk       (0x1U << IOMUX_EXINTC3_EXINT11_GPB_Pos) /*!< 0x00001000 */
#define IOMUX_EXINTC3_EXINT11_GPB           IOMUX_EXINTC3_EXINT11_GPB_Msk           /*!< GPIOB pin 11 */
#define IOMUX_EXINTC3_EXINT11_GPC_Pos       (13U)
#define IOMUX_EXINTC3_EXINT11_GPC_Msk       (0x1U << IOMUX_EXINTC3_EXINT11_GPC_Pos) /*!< 0x00002000 */
#define IOMUX_EXINTC3_EXINT11_GPC           IOMUX_EXINTC3_EXINT11_GPC_Msk           /*!< GPIOC pin 11 */
#define IOMUX_EXINTC3_EXINT11_GPD_Pos       (12U)
#define IOMUX_EXINTC3_EXINT11_GPD_Msk       (0x3U << IOMUX_EXINTC3_EXINT11_GPD_Pos) /*!< 0x00003000 */
#define IOMUX_EXINTC3_EXINT11_GPD           IOMUX_EXINTC3_EXINT11_GPD_Msk           /*!< GPIOD pin 11 */
#define IOMUX_EXINTC3_EXINT11_GPE_Pos       (14U)
#define IOMUX_EXINTC3_EXINT11_GPE_Msk       (0x1U << IOMUX_EXINTC3_EXINT11_GPE_Pos) /*!< 0x00004000 */
#define IOMUX_EXINTC3_EXINT11_GPE           IOMUX_EXINTC3_EXINT11_GPE_Msk           /*!< GPIOE pin 11 */

/****************  Bit definition for IOMUX_EXINTC4 register  *****************/
/* EXINT12 configuration */
#define IOMUX_EXINTC4_EXINT12_Pos           (0U)
#define IOMUX_EXINTC4_EXINT12_Msk           (0xFU << IOMUX_EXINTC4_EXINT12_Pos)     /*!< 0x0000000F */
#define IOMUX_EXINTC4_EXINT12               IOMUX_EXINTC4_EXINT12_Msk               /*!< EXINT12[3:0] bits (EXINT12 input source configuration) */

#define IOMUX_EXINTC4_EXINT12_GPA           0x00000000U                             /*!< GPIOA pin 12 */
#define IOMUX_EXINTC4_EXINT12_GPB_Pos       (0U)
#define IOMUX_EXINTC4_EXINT12_GPB_Msk       (0x1U << IOMUX_EXINTC4_EXINT12_GPB_Pos) /*!< 0x00000001 */
#define IOMUX_EXINTC4_EXINT12_GPB           IOMUX_EXINTC4_EXINT12_GPB_Msk           /*!< GPIOB pin 12 */
#define IOMUX_EXINTC4_EXINT12_GPC_Pos       (1U)
#define IOMUX_EXINTC4_EXINT12_GPC_Msk       (0x1U << IOMUX_EXINTC4_EXINT12_GPC_Pos) /*!< 0x00000002 */
#define IOMUX_EXINTC4_EXINT12_GPC           IOMUX_EXINTC4_EXINT12_GPC_Msk           /*!< GPIOC pin 12 */
#define IOMUX_EXINTC4_EXINT12_GPD_Pos       (0U)
#define IOMUX_EXINTC4_EXINT12_GPD_Msk       (0x3U << IOMUX_EXINTC4_EXINT12_GPD_Pos) /*!< 0x00000003 */
#define IOMUX_EXINTC4_EXINT12_GPD           IOMUX_EXINTC4_EXINT12_GPD_Msk           /*!< GPIOD pin 12 */
#define IOMUX_EXINTC4_EXINT12_GPE_Pos       (2U)
#define IOMUX_EXINTC4_EXINT12_GPE_Msk       (0x1U << IOMUX_EXINTC4_EXINT12_GPE_Pos) /*!< 0x00000004 */
#define IOMUX_EXINTC4_EXINT12_GPE           IOMUX_EXINTC4_EXINT12_GPE_Msk           /*!< GPIOE pin 12 */

/* EXINT13 configuration */
#define IOMUX_EXINTC4_EXINT13_Pos           (4U)
#define IOMUX_EXINTC4_EXINT13_Msk           (0xFU << IOMUX_EXINTC4_EXINT13_Pos)     /*!< 0x000000F0 */
#define IOMUX_EXINTC4_EXINT13               IOMUX_EXINTC4_EXINT13_Msk               /*!< EXINT13[3:0] bits (EXINT13 input source configuration) */

#define IOMUX_EXINTC4_EXINT13_GPA           0x00000000U                             /*!< GPIOA pin 13 */
#define IOMUX_EXINTC4_EXINT13_GPB_Pos       (4U)
#define IOMUX_EXINTC4_EXINT13_GPB_Msk       (0x1U << IOMUX_EXINTC4_EXINT13_GPB_Pos) /*!< 0x00000010 */
#define IOMUX_EXINTC4_EXINT13_GPB           IOMUX_EXINTC4_EXINT13_GPB_Msk           /*!< GPIOB pin 13 */
#define IOMUX_EXINTC4_EXINT13_GPC_Pos       (5U)
#define IOMUX_EXINTC4_EXINT13_GPC_Msk       (0x1U << IOMUX_EXINTC4_EXINT13_GPC_Pos) /*!< 0x00000020 */
#define IOMUX_EXINTC4_EXINT13_GPC           IOMUX_EXINTC4_EXINT13_GPC_Msk           /*!< GPIOC pin 13 */
#define IOMUX_EXINTC4_EXINT13_GPD_Pos       (4U)
#define IOMUX_EXINTC4_EXINT13_GPD_Msk       (0x3U << IOMUX_EXINTC4_EXINT13_GPD_Pos) /*!< 0x00000030 */
#define IOMUX_EXINTC4_EXINT13_GPD           IOMUX_EXINTC4_EXINT13_GPD_Msk           /*!< GPIOD pin 13 */
#define IOMUX_EXINTC4_EXINT13_GPE_Pos       (6U)
#define IOMUX_EXINTC4_EXINT13_GPE_Msk       (0x1U << IOMUX_EXINTC4_EXINT13_GPE_Pos) /*!< 0x00000040 */
#define IOMUX_EXINTC4_EXINT13_GPE           IOMUX_EXINTC4_EXINT13_GPE_Msk           /*!< GPIOE pin 13 */

/*!< EXINT14 configuration */
#define IOMUX_EXINTC4_EXINT14_Pos           (8U)
#define IOMUX_EXINTC4_EXINT14_Msk           (0xFU << IOMUX_EXINTC4_EXINT14_Pos)     /*!< 0x00000F00 */
#define IOMUX_EXINTC4_EXINT14               IOMUX_EXINTC4_EXINT14_Msk               /*!< EXINT14[3:0] bits (EXINT14 input source configuration) */

#define IOMUX_EXINTC4_EXINT14_GPA           0x00000000U                             /*!< GPIOA pin 14 */
#define IOMUX_EXINTC4_EXINT14_GPB_Pos       (8U)
#define IOMUX_EXINTC4_EXINT14_GPB_Msk       (0x1U << IOMUX_EXINTC4_EXINT14_GPB_Pos) /*!< 0x00000100 */
#define IOMUX_EXINTC4_EXINT14_GPB           IOMUX_EXINTC4_EXINT14_GPB_Msk           /*!< GPIOB pin 14 */
#define IOMUX_EXINTC4_EXINT14_GPC_Pos       (9U)
#define IOMUX_EXINTC4_EXINT14_GPC_Msk       (0x1U << IOMUX_EXINTC4_EXINT14_GPC_Pos) /*!< 0x00000200 */
#define IOMUX_EXINTC4_EXINT14_GPC           IOMUX_EXINTC4_EXINT14_GPC_Msk           /*!< GPIOC pin 14 */
#define IOMUX_EXINTC4_EXINT14_GPD_Pos       (8U)
#define IOMUX_EXINTC4_EXINT14_GPD_Msk       (0x3U << IOMUX_EXINTC4_EXINT14_GPD_Pos) /*!< 0x00000300 */
#define IOMUX_EXINTC4_EXINT14_GPD           IOMUX_EXINTC4_EXINT14_GPD_Msk           /*!< GPIOD pin 14 */
#define IOMUX_EXINTC4_EXINT14_GPE_Pos       (10U)
#define IOMUX_EXINTC4_EXINT14_GPE_Msk       (0x1U << IOMUX_EXINTC4_EXINT14_GPE_Pos) /*!< 0x00000400 */
#define IOMUX_EXINTC4_EXINT14_GPE           IOMUX_EXINTC4_EXINT14_GPE_Msk           /*!< GPIOE pin 14 */

/*!< EXINT15 configuration */
#define IOMUX_EXINTC4_EXINT15_Pos           (12U)                             
#define IOMUX_EXINTC4_EXINT15_Msk           (0xFU << IOMUX_EXINTC4_EXINT15_Pos)     /*!< 0x0000F000 */
#define IOMUX_EXINTC4_EXINT15               IOMUX_EXINTC4_EXINT15_Msk               /*!< EXINT15[3:0] bits (EXINT15 input source configuration) */

#define IOMUX_EXINTC4_EXINT15_GPA           0x00000000U                             /*!< GPIOA pin 15 */
#define IOMUX_EXINTC4_EXINT15_GPB_Pos       (12U)
#define IOMUX_EXINTC4_EXINT15_GPB_Msk       (0x1U << IOMUX_EXINTC4_EXINT15_GPB_Pos) /*!< 0x00001000 */
#define IOMUX_EXINTC4_EXINT15_GPB           IOMUX_EXINTC4_EXINT15_GPB_Msk           /*!< GPIOB pin 15 */
#define IOMUX_EXINTC4_EXINT15_GPC_Pos       (13U)
#define IOMUX_EXINTC4_EXINT15_GPC_Msk       (0x1U << IOMUX_EXINTC4_EXINT15_GPC_Pos) /*!< 0x00002000 */
#define IOMUX_EXINTC4_EXINT15_GPC           IOMUX_EXINTC4_EXINT15_GPC_Msk           /*!< GPIOC pin 15 */
#define IOMUX_EXINTC4_EXINT15_GPD_Pos       (12U)
#define IOMUX_EXINTC4_EXINT15_GPD_Msk       (0x3U << IOMUX_EXINTC4_EXINT15_GPD_Pos) /*!< 0x00003000 */
#define IOMUX_EXINTC4_EXINT15_GPD           IOMUX_EXINTC4_EXINT15_GPD_Msk           /*!< GPIOD pin 15 */
#define IOMUX_EXINTC4_EXINT15_GPE_Pos       (14U)
#define IOMUX_EXINTC4_EXINT15_GPE_Msk       (0x1U << IOMUX_EXINTC4_EXINT15_GPE_Pos) /*!< 0x00004000 */
#define IOMUX_EXINTC4_EXINT15_GPE           IOMUX_EXINTC4_EXINT15_GPE_Msk           /*!< GPIOE pin 15 */

/*****************  Bit definition for IOMUX_REMAP2 register  *****************/
#define IOMUX_REMAP2_TMR9_MUX_Pos           (5U)
#define IOMUX_REMAP2_TMR9_MUX_Msk           (0x1U << IOMUX_REMAP2_TMR9_MUX_Pos)     /*!< 0x00000020 */
#define IOMUX_REMAP2_TMR9_MUX               IOMUX_REMAP2_TMR9_MUX_Msk               /*!< TMR9 IO multiplexing */
#define IOMUX_REMAP2_XMC_NADV_MUX_Pos       (10U)
#define IOMUX_REMAP2_XMC_NADV_MUX_Msk       (0x1U << IOMUX_REMAP2_XMC_NADV_MUX_Pos) /*!< 0x00000400 */
#define IOMUX_REMAP2_XMC_NADV_MUX           IOMUX_REMAP2_XMC_NADV_MUX_Msk           /*!< XMC NADV connect */
#define IOMUX_REMAP2_SPI4_MUX_Pos           (17U)
#define IOMUX_REMAP2_SPI4_MUX_Msk           (0x1U << IOMUX_REMAP2_SPI4_MUX_Pos)     /*!< 0x00020000 */
#define IOMUX_REMAP2_SPI4_MUX               IOMUX_REMAP2_SPI4_MUX_Msk               /*!< SPI4 IO multiplexing */
#define IOMUX_REMAP2_I2C3_MUX_Pos           (18U)
#define IOMUX_REMAP2_I2C3_MUX_Msk           (0x1U << IOMUX_REMAP2_I2C3_MUX_Pos)     /*!< 0x00040000 */
#define IOMUX_REMAP2_I2C3_MUX               IOMUX_REMAP2_I2C3_MUX_Msk               /*!< I2C3 IO multiplexing */

#define IOMUX_REMAP2_SDIO2_MUX_Pos          (19U)
#define IOMUX_REMAP2_SDIO2_MUX_Msk          (0x3U << IOMUX_REMAP2_SDIO2_MUX_Pos)    /*!< 0x00180000 */
#define IOMUX_REMAP2_SDIO2_MUX              IOMUX_REMAP2_SDIO2_MUX_Msk              /*!< SDIO2[1:0] bits (SDIO2 IO multiplexing */
#define IOMUX_REMAP2_SDIO2_MUX_0            (0x1U << IOMUX_REMAP2_SDIO2_MUX_Pos)    /*!< 0x00080000 */
#define IOMUX_REMAP2_SDIO2_MUX_1            (0x2U << IOMUX_REMAP2_SDIO2_MUX_Pos)    /*!< 0x00100000 */

