HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
#define DMA_CCTRL_MWIDTH_Pos                (10U)
#define DMA_CCTRL_MWIDTH_Msk                (0x3U << DMA_CCTRL_MWIDTH_Pos)          /*!< 0x00000C00 */
#define DMA_CCTRL_MWIDTH                    DMA_CCTRL_MWIDTH_Msk                    /*!< MWIDTH[1:0] bits (Memory data bit width) */
#define DMA_CCTRL_MWIDTH_0                  (0x1U << DMA_CCTRL_MWIDTH_Pos)          /*!< 0x00000400 */
#define DMA_CCTRL_MWIDTH_1                  (0x2U << DMA_CCTRL_MWIDTH_Pos)          /*!< 0x00000800 */

#define DMA_CCTRL_CHPL_Pos                  (12U)
#define DMA_CCTRL_CHPL_Msk                  (0x3U << DMA_CCTRL_CHPL_Pos)            /*!< 0x00003000 */
#define DMA_CCTRL_CHPL                      DMA_CCTRL_CHPL_Msk                      /*!< CHPL[1:0] bits(Channel priority level) */
#define DMA_CCTRL_CHPL_0                    (0x1U << DMA_CCTRL_CHPL_Pos)            /*!< 0x00001000 */
#define DMA_CCTRL_CHPL_1                    (0x2U << DMA_CCTRL_CHPL_Pos)            /*!< 0x00002000 */

#define DMA_CCTRL_M2M_Pos                   (14U)
#define DMA_CCTRL_M2M_Msk                   (0x1U << DMA_CCTRL_M2M_Pos)             /*!< 0x00004000 */
#define DMA_CCTRL_M2M                       DMA_CCTRL_M2M_Msk                       /*!< Memory to memory mode */

/******************  Bit definition for DMA_CDTCNT register  ******************/
#define DMA_CDTCNT_CNT_Pos                  (0U)
#define DMA_CDTCNT_CNT_Msk                  (0xFFFFU << DMA_CDTCNT_CNT_Pos)         /*!< 0x0000FFFF */
#define DMA_CDTCNT_CNT                      DMA_CDTCNT_CNT_Msk                      /*!< Number of data to transfer */

/******************  Bit definition for DMA_CPADDR register  ******************/
#define DMA_CPADDR_PADDR_Pos                (0U)
#define DMA_CPADDR_PADDR_Msk                (0xFFFFFFFFU << DMA_CPADDR_PADDR_Pos)   /*!< 0xFFFFFFFF */
#define DMA_CPADDR_PADDR                    DMA_CPADDR_PADDR_Msk                    /*!< Peripheral base address */

/******************  Bit definition for DMA_CMADDR register  ******************/
#define DMA_CMADDR_MADDR_Pos                (0U)
#define DMA_CMADDR_MADDR_Msk                (0xFFFFFFFFU << DMA_CMADDR_MADDR_Pos)   /*!< 0xFFFFFFFF */
#define DMA_CMADDR_MADDR                    DMA_CMADDR_MADDR_Msk                    /*!< Memory base address */

/*****************  Bit definition for DMA_SRC_SEL0 register  *****************/
#define DMA_SRC_SEL0_CH1_SRC_Pos            (0U)
#define DMA_SRC_SEL0_CH1_SRC_Msk            (0xFFU << DMA_SRC_SEL0_CH1_SRC_Pos)     /*!< 0x000000FF */
#define DMA_SRC_SEL0_CH1_SRC                DMA_SRC_SEL0_CH1_SRC_Msk                /*!< CH1 source select */
#define DMA_SRC_SEL0_CH2_SRC_Pos            (8U)
#define DMA_SRC_SEL0_CH2_SRC_Msk            (0xFFU << DMA_SRC_SEL0_CH2_SRC_Pos)     /*!< 0x0000FF00 */
#define DMA_SRC_SEL0_CH2_SRC                DMA_SRC_SEL0_CH2_SRC_Msk                /*!< CH2 source select */
#define DMA_SRC_SEL0_CH3_SRC_Pos            (16U)
#define DMA_SRC_SEL0_CH3_SRC_Msk            (0xFFU << DMA_SRC_SEL0_CH3_SRC_Pos)     /*!< 0x00FF0000 */
#define DMA_SRC_SEL0_CH3_SRC                DMA_SRC_SEL0_CH3_SRC_Msk                /*!< CH3 source select */
#define DMA_SRC_SEL0_CH4_SRC_Pos            (24U)
#define DMA_SRC_SEL0_CH4_SRC_Msk            (0xFFU << DMA_SRC_SEL0_CH4_SRC_Pos)     /*!< 0xFF000000 */
#define DMA_SRC_SEL0_CH4_SRC                DMA_SRC_SEL0_CH4_SRC_Msk                /*!< CH4 source select */

/*****************  Bit definition for DMA_SRC_SEL1 register  *****************/
#define DMA_SRC_SEL1_CH5_SRC_Pos            (0U)
#define DMA_SRC_SEL1_CH5_SRC_Msk            (0xFFU << DMA_SRC_SEL1_CH5_SRC_Pos)     /*!< 0x000000FF */
#define DMA_SRC_SEL1_CH5_SRC                DMA_SRC_SEL1_CH5_SRC_Msk                /*!< CH5 source select */
#define DMA_SRC_SEL1_CH6_SRC_Pos            (8U)
#define DMA_SRC_SEL1_CH6_SRC_Msk            (0xFFU << DMA_SRC_SEL1_CH6_SRC_Pos)     /*!< 0x0000FF00 */
#define DMA_SRC_SEL1_CH6_SRC                DMA_SRC_SEL1_CH6_SRC_Msk                /*!< CH6 source select */
#define DMA_SRC_SEL1_CH7_SRC_Pos            (16U)
#define DMA_SRC_SEL1_CH7_SRC_Msk            (0xFFU << DMA_SRC_SEL1_CH7_SRC_Pos)     /*!< 0x00FF0000 */
#define DMA_SRC_SEL1_CH7_SRC                DMA_SRC_SEL1_CH7_SRC_Msk                /*!< CH7 source select */
#define DMA_SRC_SEL1_DMA_FLEX_EN_Pos        (24U)
#define DMA_SRC_SEL1_DMA_FLEX_EN_Msk        (0x1U << DMA_SRC_SEL1_DMA_FLEX_EN_Pos)  /*!< 0x01000000 */
#define DMA_SRC_SEL1_DMA_FLEX_EN            DMA_SRC_SEL1_DMA_FLEX_EN_Msk            /*!< DMA flexible request mapping enable */

/******************************************************************************/
/*                                                                            */
/*                         CRC calculation unit (CRC)                         */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for CRC_DT register  ********************/
#define CRC_DT_DT_Pos                       (0U)
#define CRC_DT_DT_Msk                       (0xFFFFFFFFU << CRC_DT_DT_Pos)          /*!< 0xFFFFFFFF */
#define CRC_DT_DT                           CRC_DT_DT_Msk                           /*!< Data register bits */

/*******************  Bit definition for CRC_CDT register  ********************/
#define CRC_CDT_CDT_Pos                     (0U)
#define CRC_CDT_CDT_Msk                     (0xFFU << CRC_CDT_CDT_Pos)              /*!< 0x000000FF */
#define CRC_CDT_CDT                         CRC_CDT_CDT_Msk                         /*!< General-purpose 8-bit data register bits */

/*******************  Bit definition for CRC_CTRL register  *******************/
#define CRC_CTRL_RST_Pos                    (0U)
#define CRC_CTRL_RST_Msk                    (0x1U << CRC_CTRL_RST_Pos)              /*!< 0x00000001 */
#define CRC_CTRL_RST                        CRC_CTRL_RST_Msk                        /*!< Reset CRC calculation unit */

