HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
#define USART_CTRL2_LINEN_Pos               (14U)
#define USART_CTRL2_LINEN_Msk               (0x1U << USART_CTRL2_LINEN_Pos)         /*!< 0x00004000 */
#define USART_CTRL2_LINEN                   USART_CTRL2_LINEN_Msk                   /*!< LIN mode enable */

/*****************  Bit definition for USART_CTRL3 register  ******************/
#define USART_CTRL3_ERRIEN_Pos              (0U)
#define USART_CTRL3_ERRIEN_Msk              (0x1U << USART_CTRL3_ERRIEN_Pos)        /*!< 0x00000001 */
#define USART_CTRL3_ERRIEN                  USART_CTRL3_ERRIEN_Msk                  /*!< Error interrupt enable */
#define USART_CTRL3_IRDAEN_Pos              (1U)
#define USART_CTRL3_IRDAEN_Msk              (0x1U << USART_CTRL3_IRDAEN_Pos)        /*!< 0x00000002 */
#define USART_CTRL3_IRDAEN                  USART_CTRL3_IRDAEN_Msk                  /*!< IrDA enable */
#define USART_CTRL3_IRDALP_Pos              (2U)
#define USART_CTRL3_IRDALP_Msk              (0x1U << USART_CTRL3_IRDALP_Pos)        /*!< 0x00000004 */
#define USART_CTRL3_IRDALP                  USART_CTRL3_IRDALP_Msk                  /*!< IrDA low-power mode */
#define USART_CTRL3_SLBEN_Pos               (3U)
#define USART_CTRL3_SLBEN_Msk               (0x1U << USART_CTRL3_SLBEN_Pos)         /*!< 0x00000008 */
#define USART_CTRL3_SLBEN                   USART_CTRL3_SLBEN_Msk                   /*!< Single-wire bidirectional half-duplex enable */
#define USART_CTRL3_SCNACKEN_Pos            (4U)
#define USART_CTRL3_SCNACKEN_Msk            (0x1U << USART_CTRL3_SCNACKEN_Pos)      /*!< 0x00000010 */
#define USART_CTRL3_SCNACKEN                USART_CTRL3_SCNACKEN_Msk                /*!< Smart Card NACK enable */
#define USART_CTRL3_SCMEN_Pos               (5U)
#define USART_CTRL3_SCMEN_Msk               (0x1U << USART_CTRL3_SCMEN_Pos)         /*!< 0x00000020 */
#define USART_CTRL3_SCMEN                   USART_CTRL3_SCMEN_Msk                   /*!< Smart Card mode enable */
#define USART_CTRL3_DMAREN_Pos              (6U)
#define USART_CTRL3_DMAREN_Msk              (0x1U << USART_CTRL3_DMAREN_Pos)        /*!< 0x00000040 */
#define USART_CTRL3_DMAREN                  USART_CTRL3_DMAREN_Msk                  /*!< DMA receiver enable */
#define USART_CTRL3_DMATEN_Pos              (7U)
#define USART_CTRL3_DMATEN_Msk              (0x1U << USART_CTRL3_DMATEN_Pos)        /*!< 0x00000080 */
#define USART_CTRL3_DMATEN                  USART_CTRL3_DMATEN_Msk                  /*!< DMA transmitter enable */
#define USART_CTRL3_RTSEN_Pos               (8U)
#define USART_CTRL3_RTSEN_Msk               (0x1U << USART_CTRL3_RTSEN_Pos)         /*!< 0x00000100 */
#define USART_CTRL3_RTSEN                   USART_CTRL3_RTSEN_Msk                   /*!< RTS enable */
#define USART_CTRL3_CTSEN_Pos               (9U)
#define USART_CTRL3_CTSEN_Msk               (0x1U << USART_CTRL3_CTSEN_Pos)         /*!< 0x00000200 */
#define USART_CTRL3_CTSEN                   USART_CTRL3_CTSEN_Msk                   /*!< CTS enable */
#define USART_CTRL3_CTSCFIEN_Pos            (10U)
#define USART_CTRL3_CTSCFIEN_Msk            (0x1U << USART_CTRL3_CTSCFIEN_Pos)      /*!< 0x00000400 */
#define USART_CTRL3_CTSCFIEN                USART_CTRL3_CTSCFIEN_Msk                /*!< CTSCF interrupt enable */

/******************  Bit definition for USART_GDIV register  ******************/
#define USART_GDIV_ISDIV_Pos                (0U)
#define USART_GDIV_ISDIV_Msk                (0xFFU << USART_GDIV_ISDIV_Pos)         /*!< 0x000000FF */
#define USART_GDIV_ISDIV                    USART_GDIV_ISDIV_Msk                    /*!< ISDIV[7:0] bits (IrDA/Smart Card division) */
#define USART_GDIV_ISDIV_0                  (0x01U << USART_GDIV_ISDIV_Pos)         /*!< 0x00000001 */
#define USART_GDIV_ISDIV_1                  (0x02U << USART_GDIV_ISDIV_Pos)         /*!< 0x00000002 */
#define USART_GDIV_ISDIV_2                  (0x04U << USART_GDIV_ISDIV_Pos)         /*!< 0x00000004 */
#define USART_GDIV_ISDIV_3                  (0x08U << USART_GDIV_ISDIV_Pos)         /*!< 0x00000008 */
#define USART_GDIV_ISDIV_4                  (0x10U << USART_GDIV_ISDIV_Pos)         /*!< 0x00000010 */
#define USART_GDIV_ISDIV_5                  (0x20U << USART_GDIV_ISDIV_Pos)         /*!< 0x00000020 */
#define USART_GDIV_ISDIV_6                  (0x40U << USART_GDIV_ISDIV_Pos)         /*!< 0x00000040 */
#define USART_GDIV_ISDIV_7                  (0x80U << USART_GDIV_ISDIV_Pos)         /*!< 0x00000080 */

#define USART_GDIV_SCGT_Pos                 (8U)
#define USART_GDIV_SCGT_Msk                 (0xFFU << USART_GDIV_SCGT_Pos)          /*!< 0x0000FF00 */
#define USART_GDIV_SCGT                     USART_GDIV_SCGT_Msk                     /*!< Smart Card guard time value */

/******************************************************************************/
/*                                                                            */
/*                     Serial peripheral interface (SPI)                      */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for SPI_CTRL1 register  *******************/
#define SPI_CTRL1_CLKPHA_Pos                (0U)
#define SPI_CTRL1_CLKPHA_Msk                (0x1U << SPI_CTRL1_CLKPHA_Pos)          /*!< 0x00000001 */
#define SPI_CTRL1_CLKPHA                    SPI_CTRL1_CLKPHA_Msk                    /*!< Clock phase */
#define SPI_CTRL1_CLKPOL_Pos                (1U)
#define SPI_CTRL1_CLKPOL_Msk                (0x1U << SPI_CTRL1_CLKPOL_Pos)          /*!< 0x00000002 */
#define SPI_CTRL1_CLKPOL                    SPI_CTRL1_CLKPOL_Msk                    /*!< Clock polarity */
#define SPI_CTRL1_MSTEN_Pos                 (2U)
#define SPI_CTRL1_MSTEN_Msk                 (0x1U << SPI_CTRL1_MSTEN_Pos)           /*!< 0x00000004 */
#define SPI_CTRL1_MSTEN                     SPI_CTRL1_MSTEN_Msk                     /*!< Master enable */

/*!< MDIV configuration */
#define SPI_CTRL1_MDIV_Pos                  (3U)
#define SPI_CTRL1_MDIV_Msk                  (0x7U << SPI_CTRL1_MDIV_Pos)            /*!< 0x00000038 */
#define SPI_CTRL1_MDIV                      SPI_CTRL1_MDIV_Msk                      /*!< MDIV[2:0] bits (Master clock frequency division) */
#define SPI_CTRL1_MDIV_0                    (0x1U << SPI_CTRL1_MDIV_Pos)            /*!< 0x00000008 */
#define SPI_CTRL1_MDIV_1                    (0x2U << SPI_CTRL1_MDIV_Pos)            /*!< 0x00000010 */
#define SPI_CTRL1_MDIV_2                    (0x4U << SPI_CTRL1_MDIV_Pos)            /*!< 0x00000020 */

#define SPI_CTRL1_SPIEN_Pos                 (6U)
#define SPI_CTRL1_SPIEN_Msk                 (0x1U << SPI_CTRL1_SPIEN_Pos)           /*!< 0x00000040 */
#define SPI_CTRL1_SPIEN                     SPI_CTRL1_SPIEN_Msk                     /*!< SPI enable */
#define SPI_CTRL1_LTF_Pos                   (7U)
#define SPI_CTRL1_LTF_Msk                   (0x1U << SPI_CTRL1_LTF_Pos)             /*!< 0x00000080 */
#define SPI_CTRL1_LTF                       SPI_CTRL1_LTF_Msk                       /*!< LSB transmit first */
#define SPI_CTRL1_SWCSIL_Pos                (8U)
#define SPI_CTRL1_SWCSIL_Msk                (0x1U << SPI_CTRL1_SWCSIL_Pos)          /*!< 0x00000100 */
#define SPI_CTRL1_SWCSIL                    SPI_CTRL1_SWCSIL_Msk                    /*!< Software CS internal level */
#define SPI_CTRL1_SWCSEN_Pos                (9U)
#define SPI_CTRL1_SWCSEN_Msk                (0x1U << SPI_CTRL1_SWCSEN_Pos)          /*!< 0x00000200 */
#define SPI_CTRL1_SWCSEN                    SPI_CTRL1_SWCSEN_Msk                    /*!< Software CS enable */
#define SPI_CTRL1_ORA_Pos                   (10U)
#define SPI_CTRL1_ORA_Msk                   (0x1U << SPI_CTRL1_ORA_Pos)             /*!< 0x00000400 */
#define SPI_CTRL1_ORA                       SPI_CTRL1_ORA_Msk                       /*!< Receive-only active */
#define SPI_CTRL1_FBN_Pos                   (11U)
#define SPI_CTRL1_FBN_Msk                   (0x1U << SPI_CTRL1_FBN_Pos)             /*!< 0x00000800 */
#define SPI_CTRL1_FBN                       SPI_CTRL1_FBN_Msk                       /*!< Frame bit num */
#define SPI_CTRL1_NTC_Pos                   (12U)
#define SPI_CTRL1_NTC_Msk                   (0x1U << SPI_CTRL1_NTC_Pos)             /*!< 0x00001000 */
#define SPI_CTRL1_NTC                       SPI_CTRL1_NTC_Msk                       /*!< Transmit CRC next */
#define SPI_CTRL1_CCEN_Pos                  (13U)
#define SPI_CTRL1_CCEN_Msk                  (0x1U << SPI_CTRL1_CCEN_Pos)            /*!< 0x00002000 */
#define SPI_CTRL1_CCEN                      SPI_CTRL1_CCEN_Msk                      /*!< RC calculation enable */
#define SPI_CTRL1_SLBTD_Pos                 (14U)
#define SPI_CTRL1_SLBTD_Msk                 (0x1U << SPI_CTRL1_SLBTD_Pos)           /*!< 0x00004000 */
#define SPI_CTRL1_SLBTD                     SPI_CTRL1_SLBTD_Msk                     /*!< Single line bidirectional half-duplex transmission direction */
#define SPI_CTRL1_SLBEN_Pos                 (15U)
#define SPI_CTRL1_SLBEN_Msk                 (0x1U << SPI_CTRL1_SLBEN_Pos)           /*!< 0x00008000 */
#define SPI_CTRL1_SLBEN                     SPI_CTRL1_SLBEN_Msk                     /*!< Single line bidirectional half-duplex enable */

/******************  Bit definition for SPI_CTRL2 register  *******************/
#define SPI_CTRL2_DMAREN_Pos                (0U)
#define SPI_CTRL2_DMAREN_Msk                (0x1U << SPI_CTRL2_DMAREN_Pos)          /*!< 0x00000001 */
#define SPI_CTRL2_DMAREN                    SPI_CTRL2_DMAREN_Msk                    /*!< DMA receive enable */
#define SPI_CTRL2_DMATEN_Pos                (1U)
#define SPI_CTRL2_DMATEN_Msk                (0x1U << SPI_CTRL2_DMATEN_Pos)          /*!< 0x00000002 */
#define SPI_CTRL2_DMATEN                    SPI_CTRL2_DMATEN_Msk                    /*!< DMA transmit enable */
#define SPI_CTRL2_HWCSOE_Pos                (2U)
#define SPI_CTRL2_HWCSOE_Msk                (0x1U << SPI_CTRL2_HWCSOE_Pos)          /*!< 0x00000004 */
#define SPI_CTRL2_HWCSOE                    SPI_CTRL2_HWCSOE_Msk                    /*!< Hardware CS output enable */
#define SPI_CTRL2_ERRIE_Pos                 (5U)
#define SPI_CTRL2_ERRIE_Msk                 (0x1U << SPI_CTRL2_ERRIE_Pos)           /*!< 0x00000020 */
#define SPI_CTRL2_ERRIE                     SPI_CTRL2_ERRIE_Msk                     /*!< Error interrupt enable */
#define SPI_CTRL2_RDBFIE_Pos                (6U)
#define SPI_CTRL2_RDBFIE_Msk                (0x1U << SPI_CTRL2_RDBFIE_Pos)          /*!< 0x00000040 */
#define SPI_CTRL2_RDBFIE                    SPI_CTRL2_RDBFIE_Msk                    /*!< Receive data buffer full interrupt enable */
#define SPI_CTRL2_TDBEIE_Pos                (7U)
#define SPI_CTRL2_TDBEIE_Msk                (0x1U << SPI_CTRL2_TDBEIE_Pos)          /*!< 0x00000080 */
#define SPI_CTRL2_TDBEIE                    SPI_CTRL2_TDBEIE_Msk                    /*!< Transmit data buffer empty interrupt enable */

/*******************  Bit definition for SPI_STS register  ********************/
#define SPI_STS_RDBF_Pos                    (0U)
#define SPI_STS_RDBF_Msk                    (0x1U << SPI_STS_RDBF_Pos)              /*!< 0x00000001 */
#define SPI_STS_RDBF                        SPI_STS_RDBF_Msk                        /*!< Receive data buffer full */
#define SPI_STS_TDBE_Pos                    (1U)
#define SPI_STS_TDBE_Msk                    (0x1U << SPI_STS_TDBE_Pos)              /*!< 0x00000002 */
#define SPI_STS_TDBE                        SPI_STS_TDBE_Msk                        /*!< Transmit data buffer empty */
#define SPI_STS_ACS_Pos                     (2U)
#define SPI_STS_ACS_Msk                     (0x1U << SPI_STS_ACS_Pos)               /*!< 0x00000004 */
#define SPI_STS_ACS                         SPI_STS_ACS_Msk                         /*!< Audio channel state */
#define SPI_STS_TUERR_Pos                   (3U)
#define SPI_STS_TUERR_Msk                   (0x1U << SPI_STS_TUERR_Pos)             /*!< 0x00000008 */
#define SPI_STS_TUERR                       SPI_STS_TUERR_Msk                       /*!< Transmitter underload error */
#define SPI_STS_CCERR_Pos                   (4U)
#define SPI_STS_CCERR_Msk                   (0x1U << SPI_STS_CCERR_Pos)             /*!< 0x00000010 */
#define SPI_STS_CCERR                       SPI_STS_CCERR_Msk                       /*!< CRC error */
#define SPI_STS_MMERR_Pos                   (5U)
#define SPI_STS_MMERR_Msk                   (0x1U << SPI_STS_MMERR_Pos)             /*!< 0x00000020 */
#define SPI_STS_MMERR                       SPI_STS_MMERR_Msk                       /*!< Master mode error */
#define SPI_STS_ROERR_Pos                   (6U)
#define SPI_STS_ROERR_Msk                   (0x1U << SPI_STS_ROERR_Pos)             /*!< 0x00000040 */
#define SPI_STS_ROERR                       SPI_STS_ROERR_Msk                       /*!< Receiver overflow error */
#define SPI_STS_BF_Pos                      (7U)
#define SPI_STS_BF_Msk                      (0x1U << SPI_STS_BF_Pos)                /*!< 0x00000080 */
#define SPI_STS_BF                          SPI_STS_BF_Msk                          /*!< Busy flag */

/********************  Bit definition for SPI_DT register  ********************/
#define SPI_DT_DT_Pos                       (0U)
#define SPI_DT_DT_Msk                       (0xFFFFU << SPI_DT_DT_Pos)              /*!< 0x0000FFFF */
#define SPI_DT_DT                           SPI_DT_DT_Msk                           /*!< Data value */

/*******************  Bit definition for SPI_CPOLY register  ******************/
#define SPI_CPOLY_CPOLY_Pos                 (0U)
#define SPI_CPOLY_CPOLY_Msk                 (0xFFFFU << SPI_CPOLY_CPOLY_Pos)        /*!< 0x0000FFFF */
#define SPI_CPOLY_CPOLY                     SPI_CPOLY_CPOLY_Msk                     /*!< CRC polynomial */

/*******************  Bit definition for SPI_RCRC register  *******************/
#define SPI_RCRC_RCRC_Pos                   (0U)
#define SPI_RCRC_RCRC_Msk                   (0xFFFFU << SPI_RCRC_RCRC_Pos)          /*!< 0x0000FFFF */
#define SPI_RCRC_RCRC                       SPI_RCRC_RCRC_Msk                       /*!< Receive CRC */

