HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
/*******************  Bit definition for BPR_DT10 register  *******************/
#define BPR_DT10_DT_Pos                     (0U)
#define BPR_DT10_DT_Msk                     (0xFFFFU << BPR_DT10_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT10_DT                         BPR_DT10_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT11 register  *******************/
#define BPR_DT11_DT_Pos                     (0U)
#define BPR_DT11_DT_Msk                     (0xFFFFU << BPR_DT11_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT11_DT                         BPR_DT11_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT12 register  *******************/
#define BPR_DT12_DT_Pos                     (0U)
#define BPR_DT12_DT_Msk                     (0xFFFFU << BPR_DT12_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT12_DT                         BPR_DT12_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT13 register  *******************/
#define BPR_DT13_DT_Pos                     (0U)
#define BPR_DT13_DT_Msk                     (0xFFFFU << BPR_DT13_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT13_DT                         BPR_DT13_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT14 register  *******************/
#define BPR_DT14_DT_Pos                     (0U)
#define BPR_DT14_DT_Msk                     (0xFFFFU << BPR_DT14_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT14_DT                         BPR_DT14_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT15 register  *******************/
#define BPR_DT15_DT_Pos                     (0U)
#define BPR_DT15_DT_Msk                     (0xFFFFU << BPR_DT15_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT15_DT                         BPR_DT15_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT16 register  *******************/
#define BPR_DT16_DT_Pos                     (0U)
#define BPR_DT16_DT_Msk                     (0xFFFFU << BPR_DT16_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT16_DT                         BPR_DT16_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT17 register  *******************/
#define BPR_DT17_DT_Pos                     (0U)
#define BPR_DT17_DT_Msk                     (0xFFFFU << BPR_DT17_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT17_DT                         BPR_DT17_DT_Msk                         /*!< Battery powered domain data */

/******************  Bit definition for BPR_DT18 register  ********************/
#define BPR_DT18_DT_Pos                     (0U)
#define BPR_DT18_DT_Msk                     (0xFFFFU << BPR_DT18_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT18_DT                         BPR_DT18_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT19 register  *******************/
#define BPR_DT19_DT_Pos                     (0U)
#define BPR_DT19_DT_Msk                     (0xFFFFU << BPR_DT19_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT19_DT                         BPR_DT19_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT20 register  *******************/
#define BPR_DT20_DT_Pos                     (0U)
#define BPR_DT20_DT_Msk                     (0xFFFFU << BPR_DT20_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT20_DT                         BPR_DT20_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT21 register  *******************/
#define BPR_DT21_DT_Pos                     (0U)
#define BPR_DT21_DT_Msk                     (0xFFFFU << BPR_DT21_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT21_DT                         BPR_DT21_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT22 register  *******************/
#define BPR_DT22_DT_Pos                     (0U)
#define BPR_DT22_DT_Msk                     (0xFFFFU << BPR_DT22_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT22_DT                         BPR_DT22_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT23 register  *******************/
#define BPR_DT23_DT_Pos                     (0U)
#define BPR_DT23_DT_Msk                     (0xFFFFU << BPR_DT23_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT23_DT                         BPR_DT23_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT24 register  *******************/
#define BPR_DT24_DT_Pos                     (0U)
#define BPR_DT24_DT_Msk                     (0xFFFFU << BPR_DT24_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT24_DT                         BPR_DT24_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT25 register  *******************/
#define BPR_DT25_DT_Pos                     (0U)
#define BPR_DT25_DT_Msk                     (0xFFFFU << BPR_DT25_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT25_DT                         BPR_DT25_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT26 register  *******************/
#define BPR_DT26_DT_Pos                     (0U)
#define BPR_DT26_DT_Msk                     (0xFFFFU << BPR_DT26_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT26_DT                         BPR_DT26_DT_Msk                         /*!< Battery powered domain data */

