HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
#define ADC_CTRL1_OCPCNT_Pos                (13U)
#define ADC_CTRL1_OCPCNT_Msk                (0x7U << ADC_CTRL1_OCPCNT_Pos)          /*!< 0x0000E000 */
#define ADC_CTRL1_OCPCNT                    ADC_CTRL1_OCPCNT_Msk                    /*!< OCPCNT[2:0] bits (Partitioned mode conversion count of ordinary channels) */
#define ADC_CTRL1_OCPCNT_0                  (0x1U << ADC_CTRL1_OCPCNT_Pos)          /*!< 0x00002000 */
#define ADC_CTRL1_OCPCNT_1                  (0x2U << ADC_CTRL1_OCPCNT_Pos)          /*!< 0x00004000 */
#define ADC_CTRL1_OCPCNT_2                  (0x4U << ADC_CTRL1_OCPCNT_Pos)          /*!< 0x00008000 */

#define ADC_CTRL1_MSSEL_Pos                 (16U)
#define ADC_CTRL1_MSSEL_Msk                 (0xFU << ADC_CTRL1_MSSEL_Pos)           /*!< 0x000F0000 */
#define ADC_CTRL1_MSSEL                     ADC_CTRL1_MSSEL_Msk                     /*!< MSSEL[3:0] bits (Master/slave mode select) */
#define ADC_CTRL1_MSSEL_0                   (0x1U << ADC_CTRL1_MSSEL_Pos)           /*!< 0x00010000 */
#define ADC_CTRL1_MSSEL_1                   (0x2U << ADC_CTRL1_MSSEL_Pos)           /*!< 0x00020000 */
#define ADC_CTRL1_MSSEL_2                   (0x4U << ADC_CTRL1_MSSEL_Pos)           /*!< 0x00040000 */
#define ADC_CTRL1_MSSEL_3                   (0x8U << ADC_CTRL1_MSSEL_Pos)           /*!< 0x00080000 */

#define ADC_CTRL1_PCVMEN_Pos                (22U)
#define ADC_CTRL1_PCVMEN_Msk                (0x1U << ADC_CTRL1_PCVMEN_Pos)          /*!< 0x00400000 */
#define ADC_CTRL1_PCVMEN                    ADC_CTRL1_PCVMEN_Msk                    /*!< Voltage monitoring enable on preempted channels */
#define ADC_CTRL1_OCVMEN_Pos                (23U)
#define ADC_CTRL1_OCVMEN_Msk                (0x1U << ADC_CTRL1_OCVMEN_Pos)          /*!< 0x00800000 */
#define ADC_CTRL1_OCVMEN                    ADC_CTRL1_OCVMEN_Msk                    /*!< Voltage monitoring enable on ordinary channels */

/* Legacy defines */
#define ADC_CTRL1_CCEIEN                    (ADC_CTRL1_CCCIEN)
#define ADC_CTRL1_PCCEIEN                   (ADC_CTRL1_PCCCIEN)

/******************  Bit definition for ADC_CTRL2 register  *******************/
#define ADC_CTRL2_ADCEN_Pos                 (0U)
#define ADC_CTRL2_ADCEN_Msk                 (0x1U << ADC_CTRL2_ADCEN_Pos)           /*!< 0x00000001 */
#define ADC_CTRL2_ADCEN                     ADC_CTRL2_ADCEN_Msk                     /*!< A/D converter enable */
#define ADC_CTRL2_RPEN_Pos                  (1U)
#define ADC_CTRL2_RPEN_Msk                  (0x1U << ADC_CTRL2_RPEN_Pos)            /*!< 0x00000002 */
#define ADC_CTRL2_RPEN                      ADC_CTRL2_RPEN_Msk                      /*!< Repition mode enable */
#define ADC_CTRL2_ADCAL_Pos                 (2U)
#define ADC_CTRL2_ADCAL_Msk                 (0x1U << ADC_CTRL2_ADCAL_Pos)           /*!< 0x00000004 */
#define ADC_CTRL2_ADCAL                     ADC_CTRL2_ADCAL_Msk                     /*!< A/D calibration */
#define ADC_CTRL2_ADCALINIT_Pos             (3U)
#define ADC_CTRL2_ADCALINIT_Msk             (0x1U << ADC_CTRL2_ADCALINIT_Pos)       /*!< 0x00000008 */
#define ADC_CTRL2_ADCALINIT                 ADC_CTRL2_ADCALINIT_Msk                 /*!< Initialize A/D calibration */
#define ADC_CTRL2_OCDMAEN_Pos               (8U)
#define ADC_CTRL2_OCDMAEN_Msk               (0x1U << ADC_CTRL2_OCDMAEN_Pos)         /*!< 0x00000100 */
#define ADC_CTRL2_OCDMAEN                   ADC_CTRL2_OCDMAEN_Msk                   /*!< DMA transfer enable of ordinary channels */
#define ADC_CTRL2_DTALIGN_Pos               (11U)
#define ADC_CTRL2_DTALIGN_Msk               (0x1U << ADC_CTRL2_DTALIGN_Pos)         /*!< 0x00000800 */
#define ADC_CTRL2_DTALIGN                   ADC_CTRL2_DTALIGN_Msk                   /*!< Data alignment */

#define ADC_CTRL2_PCTESEL_Pos               (12U)
#define ADC_CTRL2_PCTESEL_Msk               (0x7U << ADC_CTRL2_PCTESEL_Pos)         /*!< 0x00007000 */
#define ADC_CTRL2_PCTESEL                   ADC_CTRL2_PCTESEL_Msk                   /*!< PCTESEL[2:0] bits (Trigger event select for preempted channels conversion) */
#define ADC_CTRL2_PCTESEL_0                 (0x1U << ADC_CTRL2_PCTESEL_Pos)         /*!< 0x00001000 */
#define ADC_CTRL2_PCTESEL_1                 (0x2U << ADC_CTRL2_PCTESEL_Pos)         /*!< 0x00002000 */
#define ADC_CTRL2_PCTESEL_2                 (0x4U << ADC_CTRL2_PCTESEL_Pos)         /*!< 0x00004000 */

#define ADC_CTRL2_PCTEN_Pos                 (15U)
#define ADC_CTRL2_PCTEN_Msk                 (0x1U << ADC_CTRL2_PCTEN_Pos)           /*!< 0x00008000 */
#define ADC_CTRL2_PCTEN                     ADC_CTRL2_PCTEN_Msk                     /*!< Trigger mode enable for preempted channels conversion */

#define ADC_CTRL2_OCTESEL_Pos               (17U)
#define ADC_CTRL2_OCTESEL_Msk               (0x7U << ADC_CTRL2_OCTESEL_Pos)         /*!< 0x000E0000 */
#define ADC_CTRL2_OCTESEL                   ADC_CTRL2_OCTESEL_Msk                   /*!< OCTESEL[2:0] bits (Trigger event select for ordinary channels conversion) */
#define ADC_CTRL2_OCTESEL_0                 (0x1U << ADC_CTRL2_OCTESEL_Pos)         /*!< 0x00020000 */
#define ADC_CTRL2_OCTESEL_1                 (0x2U << ADC_CTRL2_OCTESEL_Pos)         /*!< 0x00040000 */
#define ADC_CTRL2_OCTESEL_2                 (0x4U << ADC_CTRL2_OCTESEL_Pos)         /*!< 0x00080000 */

#define ADC_CTRL2_OCTEN_Pos                 (20U)
#define ADC_CTRL2_OCTEN_Msk                 (0x1U << ADC_CTRL2_OCTEN_Pos)           /*!< 0x00100000 */
#define ADC_CTRL2_OCTEN                     ADC_CTRL2_OCTEN_Msk                     /*!< Trigger mode enable for ordinary channels conversion */
#define ADC_CTRL2_PCSWTRG_Pos               (21U)
#define ADC_CTRL2_PCSWTRG_Msk               (0x1U << ADC_CTRL2_PCSWTRG_Pos)         /*!< 0x00200000 */
#define ADC_CTRL2_PCSWTRG                   ADC_CTRL2_PCSWTRG_Msk                   /*!< Conversion of preempted channels triggered by software */
#define ADC_CTRL2_OCSWTRG_Pos               (22U)
#define ADC_CTRL2_OCSWTRG_Msk               (0x1U << ADC_CTRL2_OCSWTRG_Pos)         /*!< 0x00400000 */
#define ADC_CTRL2_OCSWTRG                   ADC_CTRL2_OCSWTRG_Msk                   /*!< Conversion of ordinary channels triggered by software */
#define ADC_CTRL2_ITSRVEN_Pos               (23U)
#define ADC_CTRL2_ITSRVEN_Msk               (0x1U << ADC_CTRL2_ITSRVEN_Pos)         /*!< 0x00800000 */
#define ADC_CTRL2_ITSRVEN                   ADC_CTRL2_ITSRVEN_Msk                   /*!< Internal temperature sensor and VINTRV enable */

/*******************  Bit definition for ADC_SPT1 register  *******************/
#define ADC_SPT1_CSPT10_Pos                 (0U)
#define ADC_SPT1_CSPT10_Msk                 (0x7U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000007 */
#define ADC_SPT1_CSPT10                     ADC_SPT1_CSPT10_Msk                     /*!< CSPT10[2:0] bits (Sample time selection of channel ADC_IN10) */
#define ADC_SPT1_CSPT10_0                   (0x1U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000001 */
#define ADC_SPT1_CSPT10_1                   (0x2U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000002 */
#define ADC_SPT1_CSPT10_2                   (0x4U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000004 */

#define ADC_SPT1_CSPT11_Pos                 (3U)
#define ADC_SPT1_CSPT11_Msk                 (0x7U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000038 */
#define ADC_SPT1_CSPT11                     ADC_SPT1_CSPT11_Msk                     /*!< CSPT11[2:0] bits (Sample time selection of channel ADC_IN11) */
#define ADC_SPT1_CSPT11_0                   (0x1U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000008 */
#define ADC_SPT1_CSPT11_1                   (0x2U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000010 */
#define ADC_SPT1_CSPT11_2                   (0x4U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000020 */

#define ADC_SPT1_CSPT12_Pos                 (6U)
#define ADC_SPT1_CSPT12_Msk                 (0x7U << ADC_SPT1_CSPT12_Pos)           /*!< 0x000001C0 */
#define ADC_SPT1_CSPT12                     ADC_SPT1_CSPT12_Msk                     /*!< CSPT12[2:0] bits (Sample time selection of channel ADC_IN12) */
#define ADC_SPT1_CSPT12_0                   (0x1U << ADC_SPT1_CSPT12_Pos)           /*!< 0x00000040 */
#define ADC_SPT1_CSPT12_1                   (0x2U << ADC_SPT1_CSPT12_Pos)           /*!< 0x00000080 */
#define ADC_SPT1_CSPT12_2                   (0x4U << ADC_SPT1_CSPT12_Pos)           /*!< 0x00000100 */

#define ADC_SPT1_CSPT13_Pos                 (9U)
#define ADC_SPT1_CSPT13_Msk                 (0x7U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000E00 */
#define ADC_SPT1_CSPT13                     ADC_SPT1_CSPT13_Msk                     /*!< CSPT13[2:0] bits (Sample time selection of channel ADC_IN13) */
#define ADC_SPT1_CSPT13_0                   (0x1U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000200 */
#define ADC_SPT1_CSPT13_1                   (0x2U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000400 */
#define ADC_SPT1_CSPT13_2                   (0x4U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000800 */

#define ADC_SPT1_CSPT14_Pos                 (12U)
#define ADC_SPT1_CSPT14_Msk                 (0x7U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00007000 */
#define ADC_SPT1_CSPT14                     ADC_SPT1_CSPT14_Msk                     /*!< CSPT14[2:0] bits (Sample time selection of channel ADC_IN14) */
#define ADC_SPT1_CSPT14_0                   (0x1U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00001000 */
#define ADC_SPT1_CSPT14_1                   (0x2U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00002000 */
#define ADC_SPT1_CSPT14_2                   (0x4U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00004000 */

#define ADC_SPT1_CSPT15_Pos                 (15U)
#define ADC_SPT1_CSPT15_Msk                 (0x7U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00038000 */
#define ADC_SPT1_CSPT15                     ADC_SPT1_CSPT15_Msk                     /*!< CSPT15[2:0] bits (Sample time selection of channel ADC_IN15) */
#define ADC_SPT1_CSPT15_0                   (0x1U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00008000 */
#define ADC_SPT1_CSPT15_1                   (0x2U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00010000 */
#define ADC_SPT1_CSPT15_2                   (0x4U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00020000 */

#define ADC_SPT1_CSPT16_Pos                 (18U)
#define ADC_SPT1_CSPT16_Msk                 (0x7U << ADC_SPT1_CSPT16_Pos)           /*!< 0x001C0000 */
#define ADC_SPT1_CSPT16                     ADC_SPT1_CSPT16_Msk                     /*!< CSPT16[2:0] bits (Sample time selection of channel ADC_IN16) */
#define ADC_SPT1_CSPT16_0                   (0x1U << ADC_SPT1_CSPT16_Pos)           /*!< 0x00040000 */
#define ADC_SPT1_CSPT16_1                   (0x2U << ADC_SPT1_CSPT16_Pos)           /*!< 0x00080000 */
#define ADC_SPT1_CSPT16_2                   (0x4U << ADC_SPT1_CSPT16_Pos)           /*!< 0x00100000 */

#define ADC_SPT1_CSPT17_Pos                 (21U)
#define ADC_SPT1_CSPT17_Msk                 (0x7U << ADC_SPT1_CSPT17_Pos)           /*!< 0x00E00000 */
#define ADC_SPT1_CSPT17                     ADC_SPT1_CSPT17_Msk                     /*!< CSPT17[2:0] bits (Sample time selection of channel ADC_IN17) */
#define ADC_SPT1_CSPT17_0                   (0x1U << ADC_SPT1_CSPT17_Pos)           /*!< 0x00200000 */
#define ADC_SPT1_CSPT17_1                   (0x2U << ADC_SPT1_CSPT17_Pos)           /*!< 0x00400000 */
#define ADC_SPT1_CSPT17_2                   (0x4U << ADC_SPT1_CSPT17_Pos)           /*!< 0x00800000 */

/*******************  Bit definition for ADC_SPT2 register  *******************/
#define ADC_SPT2_CSPT0_Pos                  (0U)
#define ADC_SPT2_CSPT0_Msk                  (0x7U << ADC_SPT2_CSPT0_Pos)            /*!< 0x00000007 */
#define ADC_SPT2_CSPT0                      ADC_SPT2_CSPT0_Msk                      /*!< CSPT0[2:0] bits (Sample time selection of channel ADC_IN0) */
#define ADC_SPT2_CSPT0_0                    (0x1U << ADC_SPT2_CSPT0_Pos)            /*!< 0x00000001 */
#define ADC_SPT2_CSPT0_1                    (0x2U << ADC_SPT2_CSPT0_Pos)            /*!< 0x00000002 */
#define ADC_SPT2_CSPT0_2                    (0x4U << ADC_SPT2_CSPT0_Pos)            /*!< 0x00000004 */

#define ADC_SPT2_CSPT1_Pos                  (3U)
#define ADC_SPT2_CSPT1_Msk                  (0x7U << ADC_SPT2_CSPT1_Pos)            /*!< 0x00000038 */
#define ADC_SPT2_CSPT1                      ADC_SPT2_CSPT1_Msk                      /*!< CSPT1[2:0] bits (Sample time selection of channel ADC_IN1) */
#define ADC_SPT2_CSPT1_0                    (0x1U << ADC_SPT2_CSPT1_Pos)            /*!< 0x00000008 */
#define ADC_SPT2_CSPT1_1                    (0x2U << ADC_SPT2_CSPT1_Pos)            /*!< 0x00000010 */
#define ADC_SPT2_CSPT1_2                    (0x4U << ADC_SPT2_CSPT1_Pos)            /*!< 0x00000020 */

#define ADC_SPT2_CSPT2_Pos                  (6U)
#define ADC_SPT2_CSPT2_Msk                  (0x7U << ADC_SPT2_CSPT2_Pos)            /*!< 0x000001C0 */
#define ADC_SPT2_CSPT2                      ADC_SPT2_CSPT2_Msk                      /*!< CSPT2[2:0] bits (Sample time selection of channel ADC_IN2) */
#define ADC_SPT2_CSPT2_0                    (0x1U << ADC_SPT2_CSPT2_Pos)            /*!< 0x00000040 */
#define ADC_SPT2_CSPT2_1                    (0x2U << ADC_SPT2_CSPT2_Pos)            /*!< 0x00000080 */
#define ADC_SPT2_CSPT2_2                    (0x4U << ADC_SPT2_CSPT2_Pos)            /*!< 0x00000100 */

#define ADC_SPT2_CSPT3_Pos                  (9U)
#define ADC_SPT2_CSPT3_Msk                  (0x7U << ADC_SPT2_CSPT3_Pos)            /*!< 0x00000E00 */
#define ADC_SPT2_CSPT3                      ADC_SPT2_CSPT3_Msk                      /*!< CSPT3[2:0] bits (Sample time selection of channel ADC_IN3) */
#define ADC_SPT2_CSPT3_0                    (0x1U << ADC_SPT2_CSPT3_Pos)            /*!< 0x00000200 */
#define ADC_SPT2_CSPT3_1                    (0x2U << ADC_SPT2_CSPT3_Pos)            /*!< 0x00000400 */
#define ADC_SPT2_CSPT3_2                    (0x4U << ADC_SPT2_CSPT3_Pos)            /*!< 0x00000800 */

#define ADC_SPT2_CSPT4_Pos                  (12U)
#define ADC_SPT2_CSPT4_Msk                  (0x7U << ADC_SPT2_CSPT4_Pos)            /*!< 0x00007000 */
#define ADC_SPT2_CSPT4                      ADC_SPT2_CSPT4_Msk                      /*!< CSPT4[2:0] bits (Sample time selection of channel ADC_IN4) */
#define ADC_SPT2_CSPT4_0                    (0x1U << ADC_SPT2_CSPT4_Pos)            /*!< 0x00001000 */
#define ADC_SPT2_CSPT4_1                    (0x2U << ADC_SPT2_CSPT4_Pos)            /*!< 0x00002000 */
#define ADC_SPT2_CSPT4_2                    (0x4U << ADC_SPT2_CSPT4_Pos)            /*!< 0x00004000 */

#define ADC_SPT2_CSPT5_Pos                  (15U)
#define ADC_SPT2_CSPT5_Msk                  (0x7U << ADC_SPT2_CSPT5_Pos)            /*!< 0x00038000 */
#define ADC_SPT2_CSPT5                      ADC_SPT2_CSPT5_Msk                      /*!< CSPT5[2:0] bits (Sample time selection of channel ADC_IN5) */
#define ADC_SPT2_CSPT5_0                    (0x1U << ADC_SPT2_CSPT5_Pos)            /*!< 0x00008000 */
#define ADC_SPT2_CSPT5_1                    (0x2U << ADC_SPT2_CSPT5_Pos)            /*!< 0x00010000 */
#define ADC_SPT2_CSPT5_2                    (0x4U << ADC_SPT2_CSPT5_Pos)            /*!< 0x00020000 */

#define ADC_SPT2_CSPT6_Pos                  (18U)
#define ADC_SPT2_CSPT6_Msk                  (0x7U << ADC_SPT2_CSPT6_Pos)            /*!< 0x001C0000 */
#define ADC_SPT2_CSPT6                      ADC_SPT2_CSPT6_Msk                      /*!< CSPT6[2:0] bits (Sample time selection of channel ADC_IN6) */
#define ADC_SPT2_CSPT6_0                    (0x1U << ADC_SPT2_CSPT6_Pos)            /*!< 0x00040000 */
#define ADC_SPT2_CSPT6_1                    (0x2U << ADC_SPT2_CSPT6_Pos)            /*!< 0x00080000 */
#define ADC_SPT2_CSPT6_2                    (0x4U << ADC_SPT2_CSPT6_Pos)            /*!< 0x00100000 */

#define ADC_SPT2_CSPT7_Pos                  (21U)
#define ADC_SPT2_CSPT7_Msk                  (0x7U << ADC_SPT2_CSPT7_Pos)            /*!< 0x00E00000 */
#define ADC_SPT2_CSPT7                      ADC_SPT2_CSPT7_Msk                      /*!< CSPT7[2:0] bits (Sample time selection of channel ADC_IN7) */
#define ADC_SPT2_CSPT7_0                    (0x1U << ADC_SPT2_CSPT7_Pos)            /*!< 0x00200000 */
#define ADC_SPT2_CSPT7_1                    (0x2U << ADC_SPT2_CSPT7_Pos)            /*!< 0x00400000 */
#define ADC_SPT2_CSPT7_2                    (0x4U << ADC_SPT2_CSPT7_Pos)            /*!< 0x00800000 */

#define ADC_SPT2_CSPT8_Pos                  (24U)
#define ADC_SPT2_CSPT8_Msk                  (0x7U << ADC_SPT2_CSPT8_Pos)            /*!< 0x07000000 */
#define ADC_SPT2_CSPT8                      ADC_SPT2_CSPT8_Msk                      /*!< CSPT8[2:0] bits (Sample time selection of channel ADC_IN8) */
#define ADC_SPT2_CSPT8_0                    (0x1U << ADC_SPT2_CSPT8_Pos)            /*!< 0x01000000 */
#define ADC_SPT2_CSPT8_1                    (0x2U << ADC_SPT2_CSPT8_Pos)            /*!< 0x02000000 */
#define ADC_SPT2_CSPT8_2                    (0x4U << ADC_SPT2_CSPT8_Pos)            /*!< 0x04000000 */

#define ADC_SPT2_CSPT9_Pos                  (27U)
#define ADC_SPT2_CSPT9_Msk                  (0x7U << ADC_SPT2_CSPT9_Pos)            /*!< 0x38000000 */
#define ADC_SPT2_CSPT9                      ADC_SPT2_CSPT9_Msk                      /*!< CSPT9[2:0] bits (Sample time selection of channel ADC_IN9) */
#define ADC_SPT2_CSPT9_0                    (0x1U << ADC_SPT2_CSPT9_Pos)            /*!< 0x08000000 */
#define ADC_SPT2_CSPT9_1                    (0x2U << ADC_SPT2_CSPT9_Pos)            /*!< 0x10000000 */
#define ADC_SPT2_CSPT9_2                    (0x4U << ADC_SPT2_CSPT9_Pos)            /*!< 0x20000000 */

