HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
/*****************  Bit definition for USB_SOFRNUM register  ******************/
#define USB_SOFRNUM_SOFNUM_Pos              (0U)
#define USB_SOFRNUM_SOFNUM_Msk              (0x7FFU << USB_SOFRNUM_SOFNUM_Pos)      /*!< 0x000007FF */
#define USB_SOFRNUM_SOFNUM                  USB_SOFRNUM_SOFNUM_Msk                  /*!< Start of frame number */
#define USB_SOFRNUM_LSOFNUM_Pos             (11U)
#define USB_SOFRNUM_LSOFNUM_Msk             (0x3U << USB_SOFRNUM_LSOFNUM_Pos)       /*!< 0x00001800 */
#define USB_SOFRNUM_LSOFNUM                 USB_SOFRNUM_LSOFNUM_Msk                 /*!< Lost SOF number */
#define USB_SOFRNUM_CLCK_Pos                (13U)
#define USB_SOFRNUM_CLCK_Msk                (0x1U << USB_SOFRNUM_CLCK_Pos)          /*!< 0x00002000 */
#define USB_SOFRNUM_CLCK                    USB_SOFRNUM_CLCK_Msk                    /*!< Connect locked */
#define USB_SOFRNUM_DMSTS_Pos               (14U)
#define USB_SOFRNUM_DMSTS_Msk               (0x1U << USB_SOFRNUM_DMSTS_Pos)         /*!< 0x00004000 */
#define USB_SOFRNUM_DMSTS                   USB_SOFRNUM_DMSTS_Msk                   /*!< D- status */
#define USB_SOFRNUM_DPSTS_Pos               (15U)
#define USB_SOFRNUM_DPSTS_Msk               (0x1U << USB_SOFRNUM_DPSTS_Pos)         /*!< 0x00008000 */
#define USB_SOFRNUM_DPSTS                   USB_SOFRNUM_DPSTS_Msk                   /*!< D+ status */

/*****************  Bit definition for USB_DEVADDR register  ******************/
#define USB_DEVADDR_ADDR_Pos                (0U)
#define USB_DEVADDR_ADDR_Msk                (0x7FU << USB_DEVADDR_ADDR_Pos)         /*!< 0x0000007F */
#define USB_DEVADDR_ADDR                    USB_DEVADDR_ADDR_Msk                    /*!< ADDR[6:0] bits (Host assign device address) */
#define USB_DEVADDR_ADDR0_Pos               (0U)
#define USB_DEVADDR_ADDR0_Msk               (0x1U << USB_DEVADDR_ADDR0_Pos)         /*!< 0x00000001 */
#define USB_DEVADDR_ADDR0                   USB_DEVADDR_ADDR0_Msk                   /*!< Bit 0 */
#define USB_DEVADDR_ADDR1_Pos               (1U)
#define USB_DEVADDR_ADDR1_Msk               (0x1U << USB_DEVADDR_ADDR1_Pos)         /*!< 0x00000002 */
#define USB_DEVADDR_ADDR1                   USB_DEVADDR_ADDR1_Msk                   /*!< Bit 1 */
#define USB_DEVADDR_ADDR2_Pos               (2U)
#define USB_DEVADDR_ADDR2_Msk               (0x1U << USB_DEVADDR_ADDR2_Pos)         /*!< 0x00000004 */
#define USB_DEVADDR_ADDR2                   USB_DEVADDR_ADDR2_Msk                   /*!< Bit 2 */
#define USB_DEVADDR_ADDR3_Pos               (3U)
#define USB_DEVADDR_ADDR3_Msk               (0x1U << USB_DEVADDR_ADDR3_Pos)         /*!< 0x00000008 */
#define USB_DEVADDR_ADDR3                   USB_DEVADDR_ADDR3_Msk                   /*!< Bit 3 */
#define USB_DEVADDR_ADDR4_Pos               (4U)
#define USB_DEVADDR_ADDR4_Msk               (0x1U << USB_DEVADDR_ADDR4_Pos)         /*!< 0x00000010 */
#define USB_DEVADDR_ADDR4                   USB_DEVADDR_ADDR4_Msk                   /*!< Bit 4 */
#define USB_DEVADDR_ADDR5_Pos               (5U)
#define USB_DEVADDR_ADDR5_Msk               (0x1U << USB_DEVADDR_ADDR5_Pos)         /*!< 0x00000020 */
#define USB_DEVADDR_ADDR5                   USB_DEVADDR_ADDR5_Msk                   /*!< Bit 5 */
#define USB_DEVADDR_ADDR6_Pos               (6U)
#define USB_DEVADDR_ADDR6_Msk               (0x1U << USB_DEVADDR_ADDR6_Pos)         /*!< 0x00000040 */
#define USB_DEVADDR_ADDR6                   USB_DEVADDR_ADDR6_Msk                   /*!< Bit 6 */

#define USB_DEVADDR_CEN_Pos                 (7U)
#define USB_DEVADDR_CEN_Msk                 (0x1U << USB_DEVADDR_CEN_Pos)           /*!< 0x00000080 */
#define USB_DEVADDR_CEN                     USB_DEVADDR_CEN_Msk                     /*!< USB core enable */

/******************  Bit definition for USB_BUFTBL register  ******************/
#define USB_BUFTBL_BTADDR_Pos               (3U)
#define USB_BUFTBL_BTADDR_Msk               (0x1FFFU << USB_BUFTBL_BTADDR_Pos)      /*!< 0x0000FFF8 */
#define USB_BUFTBL_BTADDR                   USB_BUFTBL_BTADDR_Msk                   /*!< Endpoint buffer table start address */

/*******************  Bit definition for USB_CFG register  ********************/
#define USB_CFG_SOFOUTEN_Pos                (0U)
#define USB_CFG_SOFOUTEN_Msk                (0x1U << USB_CFG_SOFOUTEN_Pos)          /*!< 0x00000001 */
#define USB_CFG_SOFOUTEN                    USB_CFG_SOFOUTEN_Msk                    /*!< SOF output enable */
#define USB_CFG_PUO_Pos                     (1U)
#define USB_CFG_PUO_Msk                     (0x1U << USB_CFG_PUO_Pos)               /*!< 0x00000002 */
#define USB_CFG_PUO                         USB_CFG_PUO_Msk                         /*!< DP pull-up off */

/*!< Buffer descriptor table */
/******************  Bit definition for USB_T0ADDR register  ******************/
#define USB_T0ADDR_T0ADDR_Pos               (1U)
#define USB_T0ADDR_T0ADDR_Msk               (0x7FFFU << USB_T0ADDR_T0ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_T0ADDR_T0ADDR                   USB_T0ADDR_T0ADDR_Msk                   /*!< Transmission buffer first address 0 */

/******************  Bit definition for USB_T1ADDR register  ******************/
#define USB_T1ADDR_T1ADDR_Pos               (1U)
#define USB_T1ADDR_T1ADDR_Msk               (0x7FFFU << USB_T1ADDR_T1ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_T1ADDR_T1ADDR                   USB_T1ADDR_T1ADDR_Msk                   /*!< Transmission buffer first address 1 */

/******************  Bit definition for USB_T2ADDR register  ******************/
#define USB_T2ADDR_T2ADDR_Pos               (1U)
#define USB_T2ADDR_T2ADDR_Msk               (0x7FFFU << USB_T2ADDR_T2ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_T2ADDR_T2ADDR                   USB_T2ADDR_T2ADDR_Msk                   /*!< Transmission buffer first address 2 */

/******************  Bit definition for USB_T3ADDR register  ******************/
#define USB_T3ADDR_T3ADDR_Pos               (1U)
#define USB_T3ADDR_T3ADDR_Msk               (0x7FFFU << USB_T3ADDR_T3ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_T3ADDR_T3ADDR                   USB_T3ADDR_T3ADDR_Msk                   /*!< Transmission buffer first address 3 */

