HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
/*****************  Bit definition for USB_T6LEN_1 register  ******************/
#define USB_T6LEN_1_T6LEN_1                 0x03FF0000U                             /*!< Transmission length 6 (high) */

/*****************  Bit definition for USB_T7LEN_0 register  ******************/
#define USB_T7LEN_0_T7LEN_0                 0x000003FFU                             /*!< Transmission length 7 (low) */

/*****************  Bit definition for USB_T7LEN_1 register  ******************/
#define USB_T7LEN_1_T7LEN_1                 0x03FF0000U                             /*!< Transmission length 7 (high) */

/*----------------------------------------------------------------------------*/

/******************  Bit definition for USB_R0ADDR register  ******************/
#define USB_R0ADDR_R0ADDR_Pos               (1U)
#define USB_R0ADDR_R0ADDR_Msk               (0x7FFFU << USB_R0ADDR_R0ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_R0ADDR_R0ADDR                   USB_R0ADDR_R0ADDR_Msk                   /*!< Reception buffer first address 0 */

/******************  Bit definition for USB_R1ADDR register  ******************/
#define USB_R1ADDR_R1ADDR_Pos               (1U)
#define USB_R1ADDR_R1ADDR_Msk               (0x7FFFU << USB_R1ADDR_R1ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_R1ADDR_R1ADDR                   USB_R1ADDR_R1ADDR_Msk                   /*!< Reception buffer first address 1 */

/******************  Bit definition for USB_R2ADDR register  ******************/
#define USB_R2ADDR_R2ADDR_Pos               (1U)
#define USB_R2ADDR_R2ADDR_Msk               (0x7FFFU << USB_R2ADDR_R2ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_R2ADDR_R2ADDR                   USB_R2ADDR_R2ADDR_Msk                   /*!< Reception buffer first address 2 */

/******************  Bit definition for USB_R3ADDR register  ******************/
#define USB_R3ADDR_R3ADDR_Pos               (1U)
#define USB_R3ADDR_R3ADDR_Msk               (0x7FFFU << USB_R3ADDR_R3ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_R3ADDR_R3ADDR                   USB_R3ADDR_R3ADDR_Msk                   /*!< Reception buffer first address 3 */

/******************  Bit definition for USB_R4ADDR register  ******************/
#define USB_R4ADDR_R4ADDR_Pos               (1U)
#define USB_R4ADDR_R4ADDR_Msk               (0x7FFFU << USB_R4ADDR_R4ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_R4ADDR_R4ADDR                   USB_R4ADDR_R4ADDR_Msk                   /*!< Reception buffer first address 4 */

/******************  Bit definition for USB_R5ADDR register  ******************/
#define USB_R5ADDR_R5ADDR_Pos               (1U)
#define USB_R5ADDR_R5ADDR_Msk               (0x7FFFU << USB_R5ADDR_R5ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_R5ADDR_R5ADDR                   USB_R5ADDR_R5ADDR_Msk                   /*!< Reception buffer first address 5 */

/******************  Bit definition for USB_R6ADDR register  ******************/
#define USB_R6ADDR_R6ADDR_Pos               (1U)
#define USB_R6ADDR_R6ADDR_Msk               (0x7FFFU << USB_R6ADDR_R6ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_R6ADDR_R6ADDR                   USB_R6ADDR_R6ADDR_Msk                   /*!< Reception buffer first address 6 */

/******************  Bit definition for USB_R7ADDR register  ******************/
#define USB_R7ADDR_R7ADDR_Pos               (1U)
#define USB_R7ADDR_R7ADDR_Msk               (0x7FFFU << USB_R7ADDR_R7ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_R7ADDR_R7ADDR                   USB_R7ADDR_R7ADDR_Msk                   /*!< Reception buffer first address 7 */

/*----------------------------------------------------------------------------*/

/******************  Bit definition for USB_R0LEN register  *******************/
#define USB_R0LEN_R0LEN_Pos                 (0U)
#define USB_R0LEN_R0LEN_Msk                 (0x3FFU << USB_R0LEN_R0LEN_Pos)         /*!< 0x000003FF */
#define USB_R0LEN_R0LEN                     USB_R0LEN_R0LEN_Msk                     /*!< Reception Length 0 */

#define USB_R0LEN_NBLK_Pos                  (10U)
#define USB_R0LEN_NBLK_Msk                  (0x1FU << USB_R0LEN_NBLK_Pos)           /*!< 0x00007C00 */
#define USB_R0LEN_NBLK                      USB_R0LEN_NBLK_Msk                      /*!< NBLK[4:0] bits (Number of blocks) */
#define USB_R0LEN_NBLK_0                    (0x01U << USB_R0LEN_NBLK_Pos)           /*!< 0x00000400 */
#define USB_R0LEN_NBLK_1                    (0x02U << USB_R0LEN_NBLK_Pos)           /*!< 0x00000800 */
#define USB_R0LEN_NBLK_2                    (0x04U << USB_R0LEN_NBLK_Pos)           /*!< 0x00001000 */
#define USB_R0LEN_NBLK_3                    (0x08U << USB_R0LEN_NBLK_Pos)           /*!< 0x00002000 */
#define USB_R0LEN_NBLK_4                    (0x10U << USB_R0LEN_NBLK_Pos)           /*!< 0x00004000 */

#define USB_R0LEN_BSIZE_Pos                 (15U)
#define USB_R0LEN_BSIZE_Msk                 (0x1U << USB_R0LEN_BSIZE_Pos)           /*!< 0x00008000 */
#define USB_R0LEN_BSIZE                     USB_R0LEN_BSIZE_Msk                     /*!< Block size */

/******************  Bit definition for USB_R1LEN register  *******************/
#define USB_R1LEN_R1LEN_Pos                 (0U)
#define USB_R1LEN_R1LEN_Msk                 (0x3FFU << USB_R1LEN_R1LEN_Pos)         /*!< 0x000003FF */
#define USB_R1LEN_R1LEN                     USB_R1LEN_R1LEN_Msk                     /*!< Reception Length 1 */

#define USB_R1LEN_NBLK_Pos                  (10U)
#define USB_R1LEN_NBLK_Msk                  (0x1FU << USB_R1LEN_NBLK_Pos)           /*!< 0x00007C00 */
#define USB_R1LEN_NBLK                      USB_R1LEN_NBLK_Msk                      /*!< NBLK[4:0] bits (Number of blocks) */
#define USB_R1LEN_NBLK_0                    (0x01U << USB_R1LEN_NBLK_Pos)           /*!< 0x00000400 */
#define USB_R1LEN_NBLK_1                    (0x02U << USB_R1LEN_NBLK_Pos)           /*!< 0x00000800 */
#define USB_R1LEN_NBLK_2                    (0x04U << USB_R1LEN_NBLK_Pos)           /*!< 0x00001000 */
#define USB_R1LEN_NBLK_3                    (0x08U << USB_R1LEN_NBLK_Pos)           /*!< 0x00002000 */
#define USB_R1LEN_NBLK_4                    (0x10U << USB_R1LEN_NBLK_Pos)           /*!< 0x00004000 */

#define USB_R1LEN_BSIZE_Pos                 (15U)
#define USB_R1LEN_BSIZE_Msk                 (0x1U << USB_R1LEN_BSIZE_Pos)           /*!< 0x00008000 */
#define USB_R1LEN_BSIZE                     USB_R1LEN_BSIZE_Msk                     /*!< Block size */

