HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
/****************  Bit definition for EMAC_MACFCTRL register  *****************/
#define EMAC_MACFCTRL_PT_Pos                (16U)
#define EMAC_MACFCTRL_PT_Msk                (0xFFFFU << EMAC_MACFCTRL_PT_Pos)       /*!< 0xFFFF0000 */
#define EMAC_MACFCTRL_PT                    EMAC_MACFCTRL_PT_Msk                    /*!< Pause Time */
#define EMAC_MACFCTRL_DZQP_Pos              (7U)
#define EMAC_MACFCTRL_DZQP_Msk              (0x1U << EMAC_MACFCTRL_DZQP_Pos)        /*!< 0x00000080 */
#define EMAC_MACFCTRL_DZQP                  EMAC_MACFCTRL_DZQP_Msk                  /*!< Disable Zero-Quanta Pause */

/*!< PLT configuration */
#define EMAC_MACFCTRL_PLT_Pos               (4U)
#define EMAC_MACFCTRL_PLT_Msk               (0x3U << EMAC_MACFCTRL_PLT_Pos)         /*!< 0x00000030 */
#define EMAC_MACFCTRL_PLT                   EMAC_MACFCTRL_PLT_Msk                   /*!< Pause Low Threshold */

#define EMAC_MACFCTRL_PLT_Minus4            0x00000000U                             /*!< Pause time minus 4 slot times */
#define EMAC_MACFCTRL_PLT_Minus28_Pos       (4U)
#define EMAC_MACFCTRL_PLT_Minus28_Msk       (0x1U << EMAC_MACFCTRL_PLT_Minus28_Pos) /*!< 0x00000010 */
#define EMAC_MACFCTRL_PLT_Minus28           EMAC_MACFCTRL_PLT_Minus28_Msk           /*!< Pause time minus 28 slot times */
#define EMAC_MACFCTRL_PLT_Minus144_Pos      (5U)                                    /*!< 0x00000020 */
#define EMAC_MACFCTRL_PLT_Minus144_Msk      (0x1U << EMAC_MACFCTRL_PLT_Minus144_Pos)
#define EMAC_MACFCTRL_PLT_Minus144          EMAC_MACFCTRL_PLT_Minus144_Msk          /*!< Pause time minus 144 slot times */
#define EMAC_MACFCTRL_PLT_Minus256_Pos      (4U)                                    /*!< 0x00000030 */
#define EMAC_MACFCTRL_PLT_Minus256_Msk      (0x3U << EMAC_MACFCTRL_PLT_Minus256_Pos)
#define EMAC_MACFCTRL_PLT_Minus256          EMAC_MACFCTRL_PLT_Minus256_Msk          /*!< Pause time minus 256 slot times */
 
#define EMAC_MACFCTRL_DUP_Pos               (3U)
#define EMAC_MACFCTRL_DUP_Msk               (0x1U << EMAC_MACFCTRL_DUP_Pos)         /*!< 0x00000008 */
#define EMAC_MACFCTRL_DUP                   EMAC_MACFCTRL_DUP_Msk                   /*!< Detect Unicast Pause Frame */
#define EMAC_MACFCTRL_ERF_Pos               (2U)
#define EMAC_MACFCTRL_ERF_Msk               (0x1U << EMAC_MACFCTRL_ERF_Pos)         /*!< 0x00000004 */
#define EMAC_MACFCTRL_ERF                   EMAC_MACFCTRL_ERF_Msk                   /*!< Enable Receive Flow control */
#define EMAC_MACFCTRL_ETF_Pos               (1U)
#define EMAC_MACFCTRL_ETF_Msk               (0x1U << EMAC_MACFCTRL_ETF_Pos)         /*!< 0x00000002 */
#define EMAC_MACFCTRL_ETF                   EMAC_MACFCTRL_ETF_Msk                   /*!< Enable Transmit Flow control */
#define EMAC_MACFCTRL_FCBBPA_Pos            (0U)
#define EMAC_MACFCTRL_FCBBPA_Msk            (0x1U << EMAC_MACFCTRL_FCBBPA_Pos)      /*!< 0x00000001 */
#define EMAC_MACFCTRL_FCBBPA                EMAC_MACFCTRL_FCBBPA_Msk                /*!< Flow Control Busy / Back Pressure Activate */

/*****************  Bit definition for EMAC_MACVLT register  ******************/
#define EMAC_MACVLT_ETV_Pos                 (16U)
#define EMAC_MACVLT_ETV_Msk                 (0x1U << EMAC_MACVLT_ETV_Pos)           /*!< 0x00010000 */
#define EMAC_MACVLT_ETV                     EMAC_MACVLT_ETV_Msk                     /*!< Enable 12-bit VLAN tag comparison */
#define EMAC_MACVLT_VTI_Pos                 (0U)
#define EMAC_MACVLT_VTI_Msk                 (0xFFFFU << EMAC_MACVLT_VTI_Pos)        /*!< 0x0000FFFF */
#define EMAC_MACVLT_VTI                     EMAC_MACVLT_VTI_Msk                     /*!< VLAN Tag Identifier (for receive frames) */

/*****************  Bit definition for EMAC_MACRWFF register  *****************/
#define EMAC_MACRWFF_D_Pos                  (0U)
#define EMAC_MACRWFF_D_Msk                  (0xFFFFFFFFU << EMAC_MACRWFF_D_Pos)     /*!< 0xFFFFFFFF */
#define EMAC_MACRWFF_D                      EMAC_MACRWFF_D_Msk                      /*!< Wake-up frame filter register data */

/*!< Eight sequential Writes to this address (offset 0x28) will write all Wake-up frame filter registers.
     Eight sequential Reads from this address (offset 0x28) will read all Wake-up frame filter registers. */
/*!< Wake-up frame filter Reg 0: Filter 0 Byte Mask
     Wake-up frame filter Reg 1: Filter 1 Byte Mask
     Wake-up frame filter Reg 2: Filter 2 Byte Mask
     Wake-up frame filter Reg 3: Filter 3 Byte Mask
     Wake-up frame filter Reg 4: RESD - Filter 3 Cmd - RESD - Filter 2 Cmd - RESD - Filter 1 Cmd - RESD - Filter 0 Cmd
     Wake-up frame filter Reg 5: Filter 3 Offset - Filter 2 Offset - Filter 1 Offset - Filter 0 Offset
     Wake-up frame filter Reg 6: Filter 1 CRC16 - Filter 0 CRC16
     Wake-up frame filter Reg 7: Filter 3 CRC16 - Filter 2 CRC16 */

/**************  Bit definition for EMAC_MACPMTCTRLSTS register  **************/
#define EMAC_MACPMTCTRLSTS_RWFFPR_Pos       (31U)
#define EMAC_MACPMTCTRLSTS_RWFFPR_Msk       (0x1U << EMAC_MACPMTCTRLSTS_RWFFPR_Pos) /*!< 0x80000000 */
#define EMAC_MACPMTCTRLSTS_RWFFPR           EMAC_MACPMTCTRLSTS_RWFFPR_Msk           /*!< Remote Wakeup Frame Filter Register Pointer Reset */
#define EMAC_MACPMTCTRLSTS_GUC_Pos          (9U)
#define EMAC_MACPMTCTRLSTS_GUC_Msk          (0x1U << EMAC_MACPMTCTRLSTS_GUC_Pos)    /*!< 0x00000200 */
#define EMAC_MACPMTCTRLSTS_GUC              EMAC_MACPMTCTRLSTS_GUC_Msk              /*!< Global UniCast */
#define EMAC_MACPMTCTRLSTS_RRWF_Pos         (6U)
#define EMAC_MACPMTCTRLSTS_RRWF_Msk         (0x1U << EMAC_MACPMTCTRLSTS_RRWF_Pos)   /*!< 0x00000040 */
#define EMAC_MACPMTCTRLSTS_RRWF             EMAC_MACPMTCTRLSTS_RRWF_Msk             /*!< Received Remote Wakeup Frame */
#define EMAC_MACPMTCTRLSTS_RMP_Pos          (5U)
#define EMAC_MACPMTCTRLSTS_RMP_Msk          (0x1U << EMAC_MACPMTCTRLSTS_RMP_Pos)    /*!< 0x00000020 */
#define EMAC_MACPMTCTRLSTS_RMP              EMAC_MACPMTCTRLSTS_RMP_Msk              /*!< Received Magic Packet */
#define EMAC_MACPMTCTRLSTS_ERWF_Pos         (2U)
#define EMAC_MACPMTCTRLSTS_ERWF_Msk         (0x1U << EMAC_MACPMTCTRLSTS_ERWF_Pos)   /*!< 0x00000004 */
#define EMAC_MACPMTCTRLSTS_ERWF             EMAC_MACPMTCTRLSTS_ERWF_Msk             /*!< Enable Remote Wakeup Frame */
#define EMAC_MACPMTCTRLSTS_EMP_Pos          (1U)
#define EMAC_MACPMTCTRLSTS_EMP_Msk          (0x1U << EMAC_MACPMTCTRLSTS_EMP_Pos)    /*!< 0x00000002 */
#define EMAC_MACPMTCTRLSTS_EMP              EMAC_MACPMTCTRLSTS_EMP_Msk              /*!< Enable Magic Packet */
#define EMAC_MACPMTCTRLSTS_PD_Pos           (0U)
#define EMAC_MACPMTCTRLSTS_PD_Msk           (0x1U << EMAC_MACPMTCTRLSTS_PD_Pos)     /*!< 0x00000001 */
#define EMAC_MACPMTCTRLSTS_PD               EMAC_MACPMTCTRLSTS_PD_Msk               /*!< Power Down */

/*****************  Bit definition for EMAC_MACISTS register  *****************/
#define EMAC_MACISTS_TIS_Pos                (9U)
#define EMAC_MACISTS_TIS_Msk                (0x1U << EMAC_MACISTS_TIS_Pos)          /*!< 0x00000200 */
#define EMAC_MACISTS_TIS                    EMAC_MACISTS_TIS_Msk                    /*!< Timestamp Interrupt Status */
#define EMAC_MACISTS_MTIS_Pos               (6U)
#define EMAC_MACISTS_MTIS_Msk               (0x1U << EMAC_MACISTS_MTIS_Pos)         /*!< 0x00000040 */
#define EMAC_MACISTS_MTIS                   EMAC_MACISTS_MTIS_Msk                   /*!< MMC Transmit Interrupt Status */
#define EMAC_MACISTS_MRIS_Pos               (5U)
#define EMAC_MACISTS_MRIS_Msk               (0x1U << EMAC_MACISTS_MRIS_Pos)         /*!< 0x00000020 */
#define EMAC_MACISTS_MRIS                   EMAC_MACISTS_MRIS_Msk                   /*!< MMC Receive Interrupt Status */
#define EMAC_MACISTS_MIS_Pos                (4U)
#define EMAC_MACISTS_MIS_Msk                (0x1U << EMAC_MACISTS_MIS_Pos)          /*!< 0x00000010 */
#define EMAC_MACISTS_MIS                    EMAC_MACISTS_MIS_Msk                    /*!< MMC Interrupt Status */
#define EMAC_MACISTS_PIS_Pos                (3U)
#define EMAC_MACISTS_PIS_Msk                (0x1U << EMAC_MACISTS_PIS_Pos)          /*!< 0x00000008 */
#define EMAC_MACISTS_PIS                    EMAC_MACISTS_PIS_Msk                    /*!< PMT Interrupt Status */

/******************  Bit definition for EMAC_MAIMR register  ******************/
#define EMAC_MAIMR_TIM_Pos                  (9U)
#define EMAC_MAIMR_TIM_Msk                  (0x1U << EMAC_MAIMR_TIM_Pos)            /*!< 0x00000200 */
#define EMAC_MAIMR_TIM                      EMAC_MAIMR_TIM_Msk                      /*!< Timestamp Interrupt Mask */
#define EMAC_MAIMR_PIM_Pos                  (3U)
#define EMAC_MAIMR_PIM_Msk                  (0x1U << EMAC_MAIMR_PIM_Pos)            /*!< 0x00000008 */
#define EMAC_MAIMR_PIM                      EMAC_MAIMR_PIM_Msk                      /*!< PMT Interrupt Mask */

/*****************  Bit definition for EMAC_MACA0H register  ******************/
#define EMAC_MACA0H_MA0H_Pos                (0U)
#define EMAC_MACA0H_MA0H_Msk                (0xFFFFU << EMAC_MACA0H_MA0H_Pos)       /*!< 0x0000FFFF */
#define EMAC_MACA0H_MA0H                    EMAC_MACA0H_MA0H_Msk                    /*!< MAC Address 0 High */

/*****************  Bit definition for EMAC_MACA0L register  ******************/
#define EMAC_MACA0L_MA0L_Pos                (0U)
#define EMAC_MACA0L_MA0L_Msk                (0xFFFFFFFFU << EMAC_MACA0L_MA0L_Pos)   /*!< 0xFFFFFFFF */
#define EMAC_MACA0L_MA0L                    EMAC_MACA0L_MA0L_Msk                    /*!< MAC Address 0 Low */

/*****************  Bit definition for EMAC_MACA1H register  ******************/
#define EMAC_MACA1H_AE_Pos                  (31U)
#define EMAC_MACA1H_AE_Msk                  (0x1U << EMAC_MACA1H_AE_Pos)            /*!< 0x80000000 */
#define EMAC_MACA1H_AE                      EMAC_MACA1H_AE_Msk                      /*!< Address Enable */
#define EMAC_MACA1H_SA_Pos                  (30U)
#define EMAC_MACA1H_SA_Msk                  (0x1U << EMAC_MACA1H_SA_Pos)            /*!< 0x40000000 */
#define EMAC_MACA1H_SA                      EMAC_MACA1H_SA_Msk                      /*!< Source Address */

/*!< MBC configuration */
#define EMAC_MACA1H_MBC_Pos                 (24U)
#define EMAC_MACA1H_MBC_Msk                 (0x3FU << EMAC_MACA1H_MBC_Pos)          /*!< 0x3F000000 */
#define EMAC_MACA1H_MBC                     EMAC_MACA1H_MBC_Msk                     /*!< Mask Byte Control */

#define EMAC_MACA1H_MBC_HBits15_8           0x20000000U                             /*!< EMAC_MACA1H [15:8] */
#define EMAC_MACA1H_MBC_HBits7_0            0x10000000U                             /*!< EMAC_MACA1H [7:0] */
#define EMAC_MACA1H_MBC_LBits31_24          0x08000000U                             /*!< EMAC_MACA1L [31:24] */
#define EMAC_MACA1H_MBC_LBits23_16          0x04000000U                             /*!< EMAC_MACA1L [23:16] */
#define EMAC_MACA1H_MBC_LBits15_8           0x02000000U                             /*!< EMAC_MACA1L [15:8] */
#define EMAC_MACA1H_MBC_LBits7_0            0x01000000U                             /*!< EMAC_MACA1L [7:0] */

