HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
/****************  Bit definition for EMAC_PTPSSINC register  *****************/
#define EMAC_PTPSSINC_SSIV_Pos              (0U)
#define EMAC_PTPSSINC_SSIV_Msk              (0xFFU << EMAC_PTPSSINC_SSIV_Pos)       /*!< 0x000000FF */
#define EMAC_PTPSSINC_SSIV                  EMAC_PTPSSINC_SSIV_Msk                  /*!< Sub-Second Increment Value */

/*****************  Bit definition for EMAC_PTPTSH register  ******************/
#define EMAC_PTPTSH_TS_Pos                  (0U)
#define EMAC_PTPTSH_TS_Msk                  (0xFFFFFFFFU << EMAC_PTPTSH_TS_Pos)     /*!< 0xFFFFFFFF */
#define EMAC_PTPTSH_TS                      EMAC_PTPTSH_TS_Msk                      /*!< Timestamp Second */

/*****************  Bit definition for EMAC_PTPTSL register  ******************/
#define EMAC_PTPTSL_AST_Pos                 (31U)
#define EMAC_PTPTSL_AST_Msk                 (0x1U << EMAC_PTPTSL_AST_Pos)           /*!< 0x80000000 */
#define EMAC_PTPTSL_AST                     EMAC_PTPTSL_AST_Msk                     /*!< Add or Subtract Time */
#define EMAC_PTPTSL_TSS_Pos                 (0U)
#define EMAC_PTPTSL_TSS_Msk                 (0x7FFFFFFFU << EMAC_PTPTSL_TSS_Pos)    /*!< 0x7FFFFFFF */
#define EMAC_PTPTSL_TSS                     EMAC_PTPTSL_TSS_Msk                     /*!< Timestamp Sub Seconds */

/****************  Bit definition for EMAC_PTPTSHUD register  *****************/
#define EMAC_PTPTSHUD_TS_Pos                (0U)
#define EMAC_PTPTSHUD_TS_Msk                (0xFFFFFFFFU << EMAC_PTPTSHUD_TS_Pos)   /*!< 0xFFFFFFFF */
#define EMAC_PTPTSHUD_TS                    EMAC_PTPTSHUD_TS_Msk                    /*!< Timestamp Second */

/****************  Bit definition for EMAC_PTPTSLUD register  *****************/
#define EMAC_PTPTSLUD_AST_Pos               (31U)
#define EMAC_PTPTSLUD_AST_Msk               (0x1U << EMAC_PTPTSLUD_AST_Pos)         /*!< 0x80000000 */
#define EMAC_PTPTSLUD_AST                   EMAC_PTPTSLUD_AST_Msk                   /*!< Add or Subtract Time */
#define EMAC_PTPTSLUD_TSS_Pos               (0U)
#define EMAC_PTPTSLUD_TSS_Msk               (0x7FFFFFFFU << EMAC_PTPTSLUD_TSS_Pos)  /*!< 0x7FFFFFFF */
#define EMAC_PTPTSLUD_TSS                   EMAC_PTPTSLUD_TSS_Msk                   /*!< Timestamp Sub Seconds */

/*****************  Bit definition for EMAC_PTPTSAD register  *****************/
#define EMAC_PTPTSAD_TAR_Pos                (0U)
#define EMAC_PTPTSAD_TAR_Msk                (0xFFFFFFFFU << EMAC_PTPTSAD_TAR_Pos)   /*!< 0xFFFFFFFF */
#define EMAC_PTPTSAD_TAR                    EMAC_PTPTSAD_TAR_Msk                    /*!< Timestamp Addend Register */

/*****************  Bit definition for EMAC_PTPTTH register  ******************/
#define EMAC_PTPTTH_TTSR_Pos                (0U)
#define EMAC_PTPTTH_TTSR_Msk                (0xFFFFFFFFU << EMAC_PTPTTH_TTSR_Pos)   /*!< 0xFFFFFFFF */
#define EMAC_PTPTTH_TTSR                    EMAC_PTPTTH_TTSR_Msk                    /*!< Target Time Seconds Register */

/*****************  Bit definition for EMAC_PTPTTL register  ******************/
#define EMAC_PTPTTL_TTLR_Pos                (0U)
#define EMAC_PTPTTL_TTLR_Msk                (0xFFFFFFFFU << EMAC_PTPTTL_TTLR_Pos)   /*!< 0xFFFFFFFF */
#define EMAC_PTPTTL_TTLR                    EMAC_PTPTTL_TTLR_Msk                    /*!< Target Timestamp Low Register */

/*****************  Bit definition for EMAC_PTPTSSR register  *****************/
#define EMAC_PTPTSSR_TTTR_Pos               (1U)
#define EMAC_PTPTSSR_TTTR_Msk               (0x1U << EMAC_PTPTSSR_TTTR_Pos)         /*!< 0x00000002 */
#define EMAC_PTPTSSR_TTTR                   EMAC_PTPTSSR_TTTR_Msk                   /*!< Timestamp Target Time Reached */
#define EMAC_PTPTSSR_TSO_Pos                (0U)
#define EMAC_PTPTSSR_TSO_Msk                (0x1U << EMAC_PTPTSSR_TSO_Pos)          /*!< 0x00000001 */
#define EMAC_PTPTSSR_TSO                    EMAC_PTPTSSR_TSO_Msk                    /*!< Timestamp Seconds Overflow */

/****************  Bit definition for EMAC_PTPPPSCR register  *****************/
#define EMAC_PTPPPSCR_POFC_Pos              (0U)
#define EMAC_PTPPPSCR_POFC_Msk              (0xFU << EMAC_PTPPPSCR_POFC_Pos)        /*!< 0x0000000F */
#define EMAC_PTPPPSCR_POFC                  EMAC_PTPPPSCR_POFC_Msk                  /*!< PPS0 Output Frequency Control */

/******************  Bit definition for EMAC_DMABM register  ******************/
#define EMAC_DMABM_AAB_Pos                  (25U)
#define EMAC_DMABM_AAB_Msk                  (0x1U << EMAC_DMABM_AAB_Pos)            /*!< 0x02000000 */
#define EMAC_DMABM_AAB                      EMAC_DMABM_AAB_Msk                      /*!< Address-Aligned Beats */
#define EMAC_DMABM_PBLx8_Pos                (24U)
#define EMAC_DMABM_PBLx8_Msk                (0x1U << EMAC_DMABM_PBLx8_Pos)          /*!< 0x01000000 */
#define EMAC_DMABM_PBLx8                    EMAC_DMABM_PBLx8_Msk                    /*!< PBLx8 Mode */
#define EMAC_DMABM_USP_Pos                  (23U)
#define EMAC_DMABM_USP_Msk                  (0x1U << EMAC_DMABM_USP_Pos)            /*!< 0x00800000 */
#define EMAC_DMABM_USP                      EMAC_DMABM_USP_Msk                      /*!< Use separate PBL */

/*!< RDP configuration */
#define EMAC_DMABM_RDP_Pos                  (17U)
#define EMAC_DMABM_RDP_Msk                  (0x3FU << EMAC_DMABM_RDP_Pos)           /*!< 0x007E0000 */
#define EMAC_DMABM_RDP                      EMAC_DMABM_RDP_Msk                      /*!< Rx DMA PBL */

#define EMAC_DMABM_RDP_1Beat                0x00020000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 1 */
#define EMAC_DMABM_RDP_2Beat                0x00040000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 2 */
#define EMAC_DMABM_RDP_4Beat                0x00080000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 4 */
#define EMAC_DMABM_RDP_8Beat                0x00100000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 8 */
#define EMAC_DMABM_RDP_16Beat               0x00200000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 16 */
#define EMAC_DMABM_RDP_32Beat               0x00400000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 32 */
#define EMAC_DMABM_RDP_PBLx8_8Beat          0x01020000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 8 */
#define EMAC_DMABM_RDP_PBLx8_16Beat         0x01040000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 16 */
#define EMAC_DMABM_RDP_PBLx8_32Beat         0x01080000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 32 */
#define EMAC_DMABM_RDP_PBLx8_64Beat         0x01100000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 64 */
#define EMAC_DMABM_RDP_PBLx8_128Beat        0x01200000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 128 */
#define EMAC_DMABM_RDP_PBLx8_256Beat        0x01400000U                             /*!< Max number of beats to be transfer in 1 Rx DMA operation is 256 */

#define EMAC_DMABM_FB_Pos                   (16U)
#define EMAC_DMABM_FB_Msk                   (0x1U << EMAC_DMABM_FB_Pos)             /*!< 0x00010000 */
#define EMAC_DMABM_FB                       EMAC_DMABM_FB_Msk                       /*!< Fixed Burst */

