HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xg.h
#define EMAC_DMAOPM_TTC_64Bytes             0x00000000U                             /*!< Threshold level of the Transmit FIFO is 64 Bytes */
#define EMAC_DMAOPM_TTC_128Bytes            0x00004000U                             /*!< Threshold level of the Transmit FIFO is 128 Bytes */
#define EMAC_DMAOPM_TTC_192Bytes            0x00008000U                             /*!< Threshold level of the Transmit FIFO is 192 Bytes */
#define EMAC_DMAOPM_TTC_256Bytes            0x0000C000U                             /*!< Threshold level of the Transmit FIFO is 256 Bytes */
#define EMAC_DMAOPM_TTC_40Bytes             0x00010000U                             /*!< Threshold level of the Transmit FIFO is 40 Bytes */
#define EMAC_DMAOPM_TTC_32Bytes             0x00014000U                             /*!< Threshold level of the Transmit FIFO is 32 Bytes */
#define EMAC_DMAOPM_TTC_24Bytes             0x00018000U                             /*!< Threshold level of the Transmit FIFO is 24 Bytes */
#define EMAC_DMAOPM_TTC_16Bytes             0x0001C000U                             /*!< Threshold level of the Transmit FIFO is 16 Bytes */

#define EMAC_DMAOPM_SSTC_Pos                (13U)
#define EMAC_DMAOPM_SSTC_Msk                (0x1U << EMAC_DMAOPM_SSTC_Pos)          /*!< 0x00002000 */
#define EMAC_DMAOPM_SSTC                    EMAC_DMAOPM_SSTC_Msk                    /*!< Start or Stop Transmission Command */
#define EMAC_DMAOPM_FEF_Pos                 (7U)
#define EMAC_DMAOPM_FEF_Msk                 (0x1U << EMAC_DMAOPM_FEF_Pos)           /*!< 0x00000080 */
#define EMAC_DMAOPM_FEF                     EMAC_DMAOPM_FEF_Msk                     /*!< Forward Error Frames */
#define EMAC_DMAOPM_FUGF_Pos                (6U)
#define EMAC_DMAOPM_FUGF_Msk                (0x1U << EMAC_DMAOPM_FUGF_Pos)          /*!< 0x00000040 */
#define EMAC_DMAOPM_FUGF                    EMAC_DMAOPM_FUGF_Msk                    /*!< Forward Undersized Good Frames */

/*!< RTC configuration */
#define EMAC_DMAOPM_RTC_Pos                 (3U)
#define EMAC_DMAOPM_RTC_Msk                 (0x3U << EMAC_DMAOPM_RTC_Pos)           /*!< 0x00000018 */
#define EMAC_DMAOPM_RTC                     EMAC_DMAOPM_RTC_Msk                     /*!< Receive Threshold Control */

#define EMAC_DMAOPM_RTC_64Bytes             0x00000000U                             /*!< Threshold level of the Receive FIFO is 64 Bytes */
#define EMAC_DMAOPM_RTC_32Bytes             0x00000008U                             /*!< Threshold level of the Receive FIFO is 32 Bytes */
#define EMAC_DMAOPM_RTC_96Bytes             0x00000010U                             /*!< Threshold level of the Receive FIFO is 96 Bytes */
#define EMAC_DMAOPM_RTC_128Bytes            0x00000018U                             /*!< Threshold level of the Receive FIFO is 128 Bytes */

#define EMAC_DMAOPM_OSF_Pos                 (2U)
#define EMAC_DMAOPM_OSF_Msk                 (0x1U << EMAC_DMAOPM_OSF_Pos)           /*!< 0x00000004 */
#define EMAC_DMAOPM_OSF                     EMAC_DMAOPM_OSF_Msk                     /*!< Operate on Second Frame */
#define EMAC_DMAOPM_SSR_Pos                 (1U)
#define EMAC_DMAOPM_SSR_Msk                 (0x1U << EMAC_DMAOPM_SSR_Pos)           /*!< 0x00000002 */
#define EMAC_DMAOPM_SSR                     EMAC_DMAOPM_SSR_Msk                     /*!< Start or Stop Receive */

/******************  Bit definition for EMAC_DMAIE register  ******************/
#define EMAC_DMAIE_NIE_Pos                  (16U)
#define EMAC_DMAIE_NIE_Msk                  (0x1U << EMAC_DMAIE_NIE_Pos)            /*!< 0x00010000 */
#define EMAC_DMAIE_NIE                      EMAC_DMAIE_NIE_Msk                      /*!< Normal Interrupt enable */
#define EMAC_DMAIE_AIE_Pos                  (15U)
#define EMAC_DMAIE_AIE_Msk                  (0x1U << EMAC_DMAIE_AIE_Pos)            /*!< 0x00008000 */
#define EMAC_DMAIE_AIE                      EMAC_DMAIE_AIE_Msk                      /*!< Abnormal interrupt enable */
#define EMAC_DMAIE_ERE_Pos                  (14U)
#define EMAC_DMAIE_ERE_Msk                  (0x1U << EMAC_DMAIE_ERE_Pos)            /*!< 0x00004000 */
#define EMAC_DMAIE_ERE                      EMAC_DMAIE_ERE_Msk                      /*!< Early Receive interrupt Enable */
#define EMAC_DMAIE_FBEE_Pos                 (13U)
#define EMAC_DMAIE_FBEE_Msk                 (0x1U << EMAC_DMAIE_FBEE_Pos)           /*!< 0x00002000 */
#define EMAC_DMAIE_FBEE                     EMAC_DMAIE_FBEE_Msk                     /*!< Fatal Bus Error Enable */
#define EMAC_DMAIE_EIE_Pos                  (10U)
#define EMAC_DMAIE_EIE_Msk                  (0x1U << EMAC_DMAIE_EIE_Pos)            /*!< 0x00000400 */
#define EMAC_DMAIE_EIE                      EMAC_DMAIE_EIE_Msk                      /*!< Early transmit Interrupt Enable */
#define EMAC_DMAIE_RWTE_Pos                 (9U)
#define EMAC_DMAIE_RWTE_Msk                 (0x1U << EMAC_DMAIE_RWTE_Pos)           /*!< 0x00000200 */
#define EMAC_DMAIE_RWTE                     EMAC_DMAIE_RWTE_Msk                     /*!< Receive Watchdog Timeout Enable */
#define EMAC_DMAIE_RSE_Pos                  (8U)
#define EMAC_DMAIE_RSE_Msk                  (0x1U << EMAC_DMAIE_RSE_Pos)            /*!< 0x00000100 */
#define EMAC_DMAIE_RSE                      EMAC_DMAIE_RSE_Msk                      /*!< Receive Stopped Enable */
#define EMAC_DMAIE_RBUE_Pos                 (7U)
#define EMAC_DMAIE_RBUE_Msk                 (0x1U << EMAC_DMAIE_RBUE_Pos)           /*!< 0x00000080 */
#define EMAC_DMAIE_RBUE                     EMAC_DMAIE_RBUE_Msk                     /*!< Receive Buffer Unavailable Enable */
#define EMAC_DMAIE_RIE_Pos                  (6U)
#define EMAC_DMAIE_RIE_Msk                  (0x1U << EMAC_DMAIE_RIE_Pos)            /*!< 0x00000040 */
#define EMAC_DMAIE_RIE                      EMAC_DMAIE_RIE_Msk                      /*!< Receive Interrupt Enable */
#define EMAC_DMAIE_UNE_Pos                  (5U)
#define EMAC_DMAIE_UNE_Msk                  (0x1U << EMAC_DMAIE_UNE_Pos)            /*!< 0x00000020 */
#define EMAC_DMAIE_UNE                      EMAC_DMAIE_UNE_Msk                      /*!< Underflow Interrupt Enable */
#define EMAC_DMAIE_OVE_Pos                  (4U)
#define EMAC_DMAIE_OVE_Msk                  (0x1U << EMAC_DMAIE_OVE_Pos)            /*!< 0x00000010 */
#define EMAC_DMAIE_OVE                      EMAC_DMAIE_OVE_Msk                      /*!< Overflow Interrupt Enable */
#define EMAC_DMAIE_TJE_Pos                  (3U)
#define EMAC_DMAIE_TJE_Msk                  (0x1U << EMAC_DMAIE_TJE_Pos)            /*!< 0x00000008 */
#define EMAC_DMAIE_TJE                      EMAC_DMAIE_TJE_Msk                      /*!< Transmit Jabber Timeout Enable */
#define EMAC_DMAIE_TUE_Pos                  (2U)
#define EMAC_DMAIE_TUE_Msk                  (0x1U << EMAC_DMAIE_TUE_Pos)            /*!< 0x00000004 */
#define EMAC_DMAIE_TUE                      EMAC_DMAIE_TUE_Msk                      /*!< Transmit Buffer Unavailable Enable */
#define EMAC_DMAIE_TSE_Pos                  (1U)
#define EMAC_DMAIE_TSE_Msk                  (0x1U << EMAC_DMAIE_TSE_Pos)            /*!< 0x00000002 */
#define EMAC_DMAIE_TSE                      EMAC_DMAIE_TSE_Msk                      /*!< Transmit Stopped Enable */
#define EMAC_DMAIE_TIE_Pos                  (0U)
#define EMAC_DMAIE_TIE_Msk                  (0x1U << EMAC_DMAIE_TIE_Pos)            /*!< 0x00000001 */
#define EMAC_DMAIE_TIE                      EMAC_DMAIE_TIE_Msk                      /*!< Transmit Interrupt Enable */

/***************  Bit definition for EMAC_DMAMFBOCNT register  ****************/
#define EMAC_DMAMFBOCNT_OBFOC_Pos           (28U)
#define EMAC_DMAMFBOCNT_OBFOC_Msk           (0x1U << EMAC_DMAMFBOCNT_OBFOC_Pos)     /*!< 0x10000000 */
#define EMAC_DMAMFBOCNT_OBFOC               EMAC_DMAMFBOCNT_OBFOC_Msk               /*!< Overflow Bit for FIFO Overflow Counter */
#define EMAC_DMAMFBOCNT_OFC_Pos             (17U)
#define EMAC_DMAMFBOCNT_OFC_Msk             (0x7FFU << EMAC_DMAMFBOCNT_OFC_Pos)     /*!< 0x0FFE0000 */
#define EMAC_DMAMFBOCNT_OFC                 EMAC_DMAMFBOCNT_OFC_Msk                 /*!< Overflow Frame Counter */
#define EMAC_DMAMFBOCNT_OBMFC_Pos           (16U)
#define EMAC_DMAMFBOCNT_OBMFC_Msk           (0x1U << EMAC_DMAMFBOCNT_OBMFC_Pos)     /*!< 0x00010000 */
#define EMAC_DMAMFBOCNT_OBMFC               EMAC_DMAMFBOCNT_OBMFC_Msk               /*!< Overflow Bit for Missed Frame Counter */
#define EMAC_DMAMFBOCNT_MFC_Pos             (0U)
#define EMAC_DMAMFBOCNT_MFC_Msk             (0xFFFFU << EMAC_DMAMFBOCNT_MFC_Pos)    /*!< 0x0000FFFF */
#define EMAC_DMAMFBOCNT_MFC                 EMAC_DMAMFBOCNT_MFC_Msk                 /*!< Missed Frame Counter */

/*****************  Bit definition for EMAC_DMACTD register  ******************/
#define EMAC_DMACTD_HTDAP_Pos               (0U)
#define EMAC_DMACTD_HTDAP_Msk               (0xFFFFFFFFU << EMAC_DMACTD_HTDAP_Pos)  /*!< 0xFFFFFFFF */
#define EMAC_DMACTD_HTDAP                   EMAC_DMACTD_HTDAP_Msk                   /*!< Host Transmit Descriptor Address Pointer */

